[
    "The cars design is like it came from a cartoon.",
    "Tankz u for being so honest.\nMuch love and respect from trinidad",
    "Amazing review your really good at this love watching you man I feel like you could review anything. Well done",
    "The Cybertruck might be the first car I've ever put a sticker on if I owned one someday. Otherwise, I constantly worry about accidentally trying to get into someone's car",
    "I will be buying one anytime soon. It's a very expensive truck. I have a lot of stuff in it.",
    "I have never even drove a car in my life because of poverty here in Africa. I wish someone could give me an old car, I will be the most happy person",
    "The drive by wire was done by Toyota first.",
    "It's bad at being a truck, it's really bad at just being a regular car, and it's not really great at offroading because the motor it uses for it's air suspension is wack. It's biggest sin is that they made the frame out of casted aluminum, and they made a heavy duty pick up truck with an aluminum frame and a steel body.",
    "If this is iconic, then so is the Fiat Multipla. It's not even roadworthy in most countries.",
    "Wait until salt from winter roads gets its hands on the body. I think the exterior will be a complete POS in three years unless it sits in a garage 22 hours a day out of the sun, rain, and snow.",
    "There is only one iconic car - The Lotus Elise. The Elise was designed in honor of Bugatti.",
    "I hate stainless steel appliances because of the fingerprints and cleaning PITA.",
    "If I get that thang, I might have to take it camping  ",
    "I can't believe there are people that don't have a clue what that truck is. The idea of a 90s mini-truck version of a Cyber Truck gives me a woody like I was back in high school again.",
    "Nah, not for me.\nA commercial refrigerator on wheels is a perfect description.",
    "There are not ever going to be \"50\" cybertrucks on the road in a person's day.",
    "I actually like how it looks Imagine my surprise today when I saw learned people found it ugly?",
    "I find it hilarious that people hate Elon so much they will piss on or vandalize any cyber truck they see. I feel bad for the owners, but if you're stupid enough to buy one, it's",
    "Why are you always so negative \nAlmost all of your videos are saying negative and little positive of the product",
    "20:59 *roll and pitch* Yaw means turning left and right, pitch means tipping forwards and backwards.",
    "It is not something I would buy, there is better stuff in the market. The screen for example is smacked on the dashboard.",
    "You know, if you drive around in a parade float, people will react to it, too. A vehicle that weighs that much has potentially volatile batteries, can accelerate well beyond any legal limit, and has no physical controls available between the yoke and the wheels.",
    "I have noticed a growing number of YouTubers giving unfavourable reviews about Tesla and SpaceX. It's almost feel like they've been activated.",
    "6 months later you need to do a follow up on the cyber truck.",
    "I didn't know it was a Tesla product. It looks like a prototype experiment that someone forgot to finish. I'm not a fan of the exterior. It did show a huge info screen......like someone's big screen home television.",
    "I swear I should have his job. I would do a million things better.",
    "I wouldnt buy a cyber truck cause having a truck means I want to tow something. That right there defeats the purpose of having a truck",
    "Being European, the statement being \"bulletproof\" is ridiculous. Only crazy gun loving Americans see this as an asset. This \"car\" will never be allowed in the streets in Europe.",
    "It looks like its stuck in the 80s. Its revolting to look at.",
    "Rust Bucket! They are all starting to rust already",
    "17:09 \"my child... I mean, the car\" ",
    "Two weeks ago I saw this car park on the street where I was walking and I looked at it as though I saw a ghost. It looked like a UFO car or something you'd see in a James Bond movie. I turned around trying to figure out what that hell was that. I saw no logo of Tesla, so I had to Google it to find out.",
    "17:08 I would call it my child too",
    "Miller Scott White Thomas Garcia Paul",
    "An issue is if the truck door locks, and if someone in the river wants to escape from the car. Normally, people can break windows by hammer or tools, but this truck window is stronger than regular.",
    "The Cybertruck is a futuristic car in a dystopian present. That's why some of you don't get it.",
    "Huel Lane",
    "Taylor Margaret Martinez Brenda Clark John",
    "This is what I like about Marques, he's honest, he bashed the flaws of the truck but also made fun of the people who",
    "Garcia Angela Davis Scott Allen Shirley",
    "Martinez Lisa Lewis Charles Clark David",
    "Gonzalez Carol Wilson Laura Martin Angela",
    "Looking different and that it's rare doesn't make it iconic. This is moronic and a death machine.",
    "Marques, if you could only drive one EV for five years, which one would you drive? Thanks and keep up the great work!",
    "Taylor Donna Gonzalez Larry Hernandez Michelle",
    "It's definitely a cool truck but i'll take a 1970 Ford F-100 in good condition any day of the week.",
    "Lmao you can do the same with pretty much just about any piece of advanced technology like a moth to a flame",
    "It looks like a car a homerimpson would make.",
    "Its cute, and looks fun.",
    "Fisher Skyway",
    "its not iconic. all it does is let you know the person driving its is a tool",
    "After so many struggles I now have a new house, and my family is happy once again. Everything is finally falling into place!!",
    "Lewis Michelle Robinson John Davis Patricia",
    "I think it looks great",
    "I'm not entirely sure the term \"visually interesting\" applies to anything here...",
    "Jackson Jessica Walker David Clark Charles",
    "Got to give credit for the rookies designers to go back to Stunts game and make an exact copy of the car in the game.",
    "Johnson Carol Garcia Eric Wilson Mark",
    "They missed the ball with this one.",
    "Garcia Maria Hernandez William Harris Anna",
    "Hermina Squares",
    "It is a piece of crap.",
    "White Brenda Davis Daniel Miller Anna",
    "I live in nowhere texas and there is one (one) single cyberruck that drives around. I'm convinced it's the same person because I refuse to accept the idea of multiple people owning a cybertruck in that area.",
    "Davis Helen Martin Nancy Davis Sandra",
    "Barney Groves",
    "not to be hater on eletric cars but i would take any porsche over a cybertruck. that is one of ugliest cars I've ever seen.",
    "As we approached a large parking lot this summer, I noticed a dumpster near where we had parked. It was the Cybertruck!",
    "Berry Plain",
    "Martinez Gary Wilson David Lopez Donna",
    "Walker Patricia Miller Richard Harris Amy",
    "Man, where did you take it?? On a tour of local trap houses??",
    "They should have just named it The Douchemobile.",
    "Moore Melissa Miller Christopher Harris Larry",
    "Allen Shirley Robinson Paul Harris Steven",
    "I think bulletproof stainless steel up to 9mm rounds is a safety feature for american customers",
    "Robinson Sandra Gonzalez Angela Young Charles",
    "Clark Donna Lewis Sandra Clark Frank",
    "Every day someone takes a photo, and the worst thing is someone always wants to talk about it. With that being said, I saw a cybertruck once here in the middle of nowhere, and they are not as bad looking in real life.",
    "The thing is that I don't play lottery any body interested to donate me one lol",
    "I was impressed by its demo because in car accidents the glass would cut and deform human faces or bodies. With the demo we do see that it does get in breaking point but with less risk that the passenger gets disfigured.",
    "Martinez Melissa Robinson Sarah Taylor Amy",
    "Moore George Martin Carol White Shirley",
    "It's a piece of garbage",
    "White Ruth Harris Edward White Margaret",
    "6209 Hadley Center",
    "Next time, make it a whole flat bed battery as thin as you can, and get the same range as the step pack, so it doesn't even look like a battery and doesn't take up the space.",
    "Ignacio Square",
    "Ive driven the model X. Cant wait to drive this. Ive driven a Model Y as well. Thats my favorite Ive driven, after the Model X",
    "Personally I like the design of it.",
    "This truck has been destroyed on durability tests.\nTesla truly is the Apple of cars, shiny stuff, but horrible consumer practices, and unpractical and disposable products",
    "I respect them,  they are like a magic power up from supermario and no other car has been that unique with that durability and performance.",
    "Bro we all know Elon musk came back with this idea from the future",
    "Didn't realize you were a Musk fanboy. This came across as very biased as you ignored so many issues the truck has.",
    "Dude your ad placement is hilarious and I love it way to keep us hooked",
    "Johnson Helen Allen Thomas White Laura",
    "I don't know why people get the idea that hospital bills in the US are insane here inside this comment section. Europe has almost 2.5x the population as the United States with a lot more infrastructure built over thousands of years. The US also has many things and rights that EU doesn't have or apparently want, which is fine. If the US wants what they have, what right do you have to try and tell them otherwise? Just work on your own country and stop attacking others. I find many of these arguments very pointless and pointless because countries are different and do things differently. Just live your life in your culture and if you don't like the car, then don't buy it. What about the US? Maine's murder rate is 1.03%. What about EU? Latvia has a 4.05%; Finland has a 1.5; Turkey has a 2.46; Estonia has 1.35; Lithuania is 2.21; and Latvia has 2.20.",
    "I hate how much I love mine, in 37 vehicles its the best car Ive ever owned.",
    "bro knew what he was doing with that ad break when he took the hammer out",
    "I would prefer if it was satin stealthy, but it is very sci-fi futuristic and the aesthetics are super cool. I feel like the online hate is largely due to Elon's",
    "I dunno if its because of the way the sun reflects off the metal or if its CGI, but some of the vids dont look real",
    "For every solution addressed via innovation, there is a subsequent problem created. I can't wait for the humanoid robot which I also think will be bullet proof against small caliber weapons.",
    "I will never care about even the best of sound systems, accelaration, looks, or steering in a car if at the same time it is a safety disaster. In a crash you won't win, your car will. It might not be totalled, but you will be hurt.",
    "Please do not use the self-driving feature of your Tesla, thank you.",
    "You might be charged with manslaughter even though they might've survived if your truck was aluminium, but you'll be fine.",
    "As much as my computer cost, I want everything perfect, but I know I am a Beta Tester. My biggest complaint is that I have to drive 250 miles to get service.",
    "A true hallmark of failure. lol.",
    "Not gonna lie. I went crazy when i first seen one on the road",
    "I like the look of it. Its different and eye catching.",
    "Oof... This is a cybertruck commercial. Not a review",
    "Lmao, calling this a review is ridiculous.",
    "You're too young to remember when they first hit the street. Millions of them on the road and that same feeling lingers.",
    "Stop complaining and move on if you're so repelled by a frikin car. It's not a casual daily driver and is meant to be an outlandish truck.",
    "Davis Nancy Lee David Martin Jeffrey",
    "ARK II",
    "Being iconic doesn't mean it's not crap. The Reliant Robin is incredibly famous and iconic because of its flaws, for example.",
    "It's an iconic piece of crap. Stop being a Musk fanboy.",
    "White Nancy Jackson Betty Jackson Jason",
    "It's weird that Marques considers variable ratio steer by wire a good feature. The tech equivalent would be to use mouse acceleration on a computer.",
    "There's a big reason why every car is designed to crumble in an accident. You will not be fine; your car will, but you won't.",
    "The F150 is a conservative fashion statement. You know, like \"I have small hands, so I buy the biggest truck I can find to make up for my inadequacies",
    "They gave you steer by wire and four wheel steering, but you paid for drive automation it doesn't have.",
    "The cybertruck is an icon of the dystopian future! A future that doesnt work! A warning for anyone who might think of buying a Tesla!",
    "Iconic?  Yes.  Good?  No.",
    "The Windows Are So Dope!!!",
    "Black man made the design way before this truck ever hit the market! We are looking at a truck that already tried to get created but just now got the technology",
    "I should do my research but how do you get all this technology? I must get my game up; I'll invest soon",
    "Might take a couple years for people to not behave like that frfr",
    "The winch on the back of the tesla cybertruck being strapped on by PLASTIC is a crime in istelf",
    "I think you meant \"moronic\".",
    "The Cybertruck is the most American made truck on the planet and also the fastest truck.",
    "Being iconic is, A normal every day person recognizing you car instantly 50 year later. This will be the one of a few that will truly be iconic",
    "This right here is the benchmark of PRODUCT REVIEWS just immaculate mkbhd",
    "It looks like that robot from the movie,  THE DAY THE EARTH STOOD STILL. Thus makes it totally awesome.",
    "There is nothing environmentally friendly about a big vehicle. Get a small gas-powered sedan instead if you want to help the environment.",
    "The Jar Jar Bonks of cars.",
    "If the truck gets stuck in mud, it will be almost impossible to get out without the help of another truck or a winch.",
    "Like everything else in the world, the bicycle is not for everyone. I like it, but wouldn't get one until at a later date when some issues are fixed. I simply don't care what you look like, if it drives and it is suitable for me, I enjoy it, simple as that.",
    "Is robocop iconic? Because it looks like something out of robocop",
    "The Volkswagen bug is iconic and heavily mass produced.",
    "Auto focus review has more views than this high production review : Ironic !",
    "I don't understand why you'd want a super duper sturdy exterior. To go from 90 km/h to 0, something has to absorb the energy, and if its not the car, it's your squishy self.",
    "Not me learning that its not available in Australia :(",
    "I saw a cyber truck pass through my hometown while I was outside talking with locals.",
    "Honestly the more I see them on the road the less impressive I get .. just not my taste for the grey/silver but that all black one ",
    "Karmann Ghia. mass produced. you'll get more looks with that thing than a Lamborghini any day of the week.",
    "In 20 years, this car will be on a list of the worst cars ever. Its been a disaster",
    "The problem is that the structure is just a fun truck, is not about things that an actual truck can do. It makes no sense.",
    "Iconic... for the wrong reasons.",
    "Alright, now take it to a car wash",
    "They are everywhere on every road here in Northern California  No one pays attention to them as much as the owners which they did.",
    "YOUR VISEOS ARE TOP NOTCH!  THANKS SO MUCH!",
    "This shit aint a review...",
    "Tbf I think the exterior design is the best bit. It just look so cool ( in my opinion)",
    "Suprised MKBHD hasn't been canceled yet for not jumping on the elon hate",
    "I like this video so much. I would like to ask your permission to share it to the other website in China for the embarrassing reason that you are blocked from accessing in China. Of course, I will give sources of the original website.",
    "My personal truck only gets used for towing a few times a year, but the invaluable part is just having an open ended bed. I use that all the time.",
    "i actually like the design. Very futuristic. And about damn time",
    "This was a really good fair review.",
    "Behind the cool first impression, it sounds like a really dumb idea to me. Isn't the wheal adding a risk of serious hazard? What happens if there is a problem with the transmission of inputs?",
    "The first time I saw it, I thought it was the ugliest car I'd ever seen. It's incredible how you can be easily influenced by society.",
    "I would pull my hoody over my head too when stepping out of a cyber truck.",
    "I literally expected marques to tear the cybertruck apart for how shitty it is but instead got suprised by the way he was glazing it",
    "Barley mentioned the interior or safety,.. very bad look marques",
    "I would rather it in full mat black with some bigger OS rims",
    "Looks like a dumpster and thats why eyeballs pop out",
    "Elon Musk loves back to the future.",
    "Are you sure the most dangerous thing isn't its lack of a crumple zone? It feels disengaged how much you gloss over really important problems with this vehicle. I can agree with a lot of those innovative pieces of tech being useful, but did they need to be in a rigid body steel block, that you cannot see out the back of without taking your eyes completely off the road?",
    "I was invited to the second step and gave Tesla  another $1000. The Cyberbeast, which is like 131k for the tag, is being sold in multiple states for 140k-143k. I think I have another 2-3 months before they call me for the final payment and delivery. This is starting to look like a major flop and I might have to walk away.",
    "Good  Sound Quality on this Video. Great work here man! ",
    "You forgot to mention the biggest thing when towing your range gets at least cut in half or more.",
    "Tech reviewers reviewing vehicles is just not a good idea, honestly. They don't truly understand what customers want. They focus too much on the tech, and the steering wheel isn't special.",
    "Your 911 Turbo is an iconic design that's evolved over what, 60 years? And how many tens of thousands of them are on the roads?",
    "Can you get it lifted?",
    "Electric power steering exists even on Russian Ladas.",
    "Is it fine that you buy a massive truck that you can't see half a metre in front of the dashboard and would literally flatten a cyclist on impact just because it looks cool? And not because you need it to perform any of the functions it is SO big and dangerous to achieve?",
    "Very well researched, as usual.   Thx.  I think I will order mine.",
    "Pavement princess",
    "The steering mechanism is so overrated because if you get dirt over the sensors or the sensors are blocked from anything, you're",
    "you got the best presentation skill in the world.",
    "Its ugly and beautiful at the same time. Brilliant! ",
    "I look at it because Im still shocked at the lack of creativity that went into the design by the team at the local kindergarten.",
    "...the intro was so cool I got whiplash to the panning of the actual truck because I forgot how stupid it looked.",
    "I thought the design was super cool, but then I drove it and it was a dog. Not just bad, terrible. I wasn't crazy about the design, but after driving it, it was sweet!",
    "Tesla has been Suckering these people. That Tin Can looks Horrendous. The Interior literally has an Ipad as a Dashboard .",
    "I heard its a .",
    "Jeeze did I like that video. One of the best review ever made by Marquee. So informative while being entertaining.",
    "Being iconic means a historic distance to begin with. It has to put a mark on an era, to become its symbol. This monstrosity is a testament of times it was created in at best. It's purpose",
    "I can't imagine what it would cost to repair these trucks after a mild accident. Most body shops have no experience fixing stainless steel body panels. You can't just fill with bondo and color match the paint",
    "I don't think the wacky design will wear off on people when it's mass produced. I see goofy cars like the Nissan Cube all the time and I always think \"why would you buy that?\" Dodge Rams are also getting very popular where I live and I think the same thing.",
    "I'm so happy this is a topic for a MBL video because the rubber necking trend around certain vehicles can be extremely dangerous.",
    "Damn i never thought there would be uglier car coming from the usa.",
    "Wow. This is gonna be a W garbage can upgrade ",
    "In middle school, everyone picked on me for being awkward. Now that I'm older and richer, everyone from high school that went to college still",
    "the VW was also mass produced but still iconic.",
    "He's so nervous he's gonna say the wrong thing. If he comes out as an Elon bootlicker, it's over. I swear he was clenching his ass so tight the microphone picked up the sound.",
    "You come across as a fan boy of this product and not an unbiased reviewer. You failed to mention any of the safety issues with this vehicle. The less than stellar brakes, the aharp edges, the failure to consider the damage to other people if this hits them.",
    "Giving a lot of leeway to tesla, that you dont give to other mfg.",
    "You ignore the fact that there's almost a full second delay at high speed, and because you don't have any road feel feeding back into that steering wheel, it's going to lead people to oversteer and overcompensate.",
    "The most dangerous thing is the hundreds of thousands of people crammed into industrial cobalt mines to get the resources for vain luxuries.",
    "So you are here to just endorse the cybertruck ? This is not a review !",
    "When they reach end of life, we can load them all onto Elon's SpaceX rockets and decorate the moon with them. Those stainless steel mirrors will reflect a lot more moonlight onto the earth at night, so we'll be able to save some electricity at night.",
    "I suppose the Elephant Man got alot of stares as well, is his look iconic?",
    "I think one of the most impressive aspects of the truck is how they've managed to remove the risk of anybody keying your car. Now all you need to do is run your finger across the body, and you've f",
    "Looks like a mac on wheels. Im surprised thats not apple that owns it.",
    "So when a steering sensor fails then what? Is there some other way to control the vehicle?",
    "In a few years, independent used car lots will be selling these for $15K.",
    "pretty sure the biker gave you the thumbs down because he understands that if he gets in an accident with a cyber truck he's dead",
    "A cool vehicle does not give the urge to point and laugh at it when it passes.",
    "What happens when you get into an accident are there crumple zones to protect your body from the effects of the impact? The skin does not seem",
    "Bullet proof stainless steel overrated  real MFs realizing that tupac would still be alive rn if he was in the overrated stainless steel cybertruck",
    "Ill get one when I retire in a few years",
    "Bunch of tanks rolling around the streets will look like a foreign country where everyone is forced to look and drive the same thing. When the government decides to shut you down, you won't be able to drive your car or there is an issue with electricity and you're dead in",
    "I never knew so many people cared about the safety of others until I read the comments in this video.",
    "The straight line speed has always been a bit ridiculous considering you'd bin the car into the ditch at the slightest curve in the road...",
    "The cybertruck isn't the first car with ss body panels.  The delorean was SS as well.",
    "This gotta be the most iconic intro ever !",
    "I'm just glad that this thing is not legal in the civilized world.",
    "Dude, once the price drops at the end of the year, nobody is going to be looking anymore. Stick to the actual features",
    "I think it looks decently cool. For a pickup truck, it's good. The issue is that Tesla's testing and QC is garbage.",
    "My husband and I just saw this vehicle on our street. Our first impression was, WOW! That looks like an alien car! Maybe it is a movie prop.",
    "Its ugly and stupid. End of review.",
    "This video is a perfect summation of why I don't like this guy's content. It's a review of hype that's both too vague",
    "It looks like they have to launch the vehicle they have launched. It's reflection during the day will hamper the other car driver.",
    "An entire 30 minute \"review\" and not a single negative thing mentioned. I never lost so much respect for Marques as I did watching this.",
    "The design looks like it was inspired by a razor blade and sharks and I'm here for it. Coolest thing on the road!",
    "The Cybertruck is basically Musk's brainchild and it encompasses what's wrong with his mindset. It's fast and cool looking, but hugely impractical and is basically an engineer's nightmare.",
    "Looks like something from Total Recall the original movie with Arnold.. not that crapstain remake",
    "Piece of unprotected steel, hence the \"truck\" with the smallest trunk. Idk what's iconic about this car, besides the looks.",
    "No mention of the rapid rusting. Or the user manual that states you shouldn't wash it in sunlight, or leave it out in the rain.",
    "I can't take this video seriously; the montage of people taking pictures just made me roll my eyes so hard. This review has already aged very poorly in just a few months, but that into is gonna mean less than nothing in like four months when the novelty of seeing one in the wild has worn off and the general public has gotten bored or tired of seeing it. I just kinda feel like if you're not gonna take a product review seriously and be honest and real about it, why do the review at all?",
    "This video throws your credibility out the window. If this is how you gloss over all the problems and ignore most of the complaints, then I imagine a lot of your videos are just as bad, but hard to notice unless you're very well versed in",
    "As for guessing the price, I think it's not surprising people guess way over. It's like guessing a woman's age; you want to go safely if you have any social",
    "Who did the intro? It's fantastic.",
    "woww",
    "I get what he's saying regarding the towing issue, but what about the other 37% of people who DO want towing? That's still millions of people, right? I think he also missed another aspect that people use trucks for and that is a large bed to transport large things. And the cybertruck's bed just isn't all that large.",
    "I think it won't have the same fate as the PT cruiser, because while one is typecast as being the one bought used by normal people with not a lot of money, this will always be the marker of a",
    "I feel like the Cybertruck is only iconic because of how ugly it is. It catches your eye because it stands out like a sore thumb.",
    "Why not talk about the safety concerns regarding driving around in a bullet proof tin can. No such thing as a bullet proof crumple zone",
    "Didn't learn anything new about the ugly tuck, but certainly learned not to listen to this fanboy",
    "Honestly saw In real and it looks amazing so unique.. I love it personally",
    "C'mon... really???\nIt's an updated Delorean!",
    "I didn't know about cybertruck before the reviews started coming. I'm very online, but not on social media like Facebook or Reddit, and",
    "The only thing you'd get from me is the disbelief that someone wasted their money yet again. Anyone remember how many miles the Tesla Semi is supposed to go before it breaks down? Wasn't it a million miles? Hahaha. I guess GM is just as bad, selling your info to insurance companies and data brokers.",
    "Does anyone know what kind of hoodie Marques is wearing?",
    "Its iconically shitty that's for sure.",
    "Steer by wire is overrated. Prove is that you hadn't yet realized that most cars you were driving for the past ten years have steered by wire.",
    "He is smart at fooling people to buy his crap. He is another Enron in the making. Burn your money instead of giving to him.",
    "I was in Santa Barbara last week for vacation and saw a surprising number of people, or the same one over and over. I can't tell",
    "\"They had to get creative\" that's a funny way to describe misleading advertisements.",
    "He completely brushes off pedestrian safety. This is almost like a paid for endorsement.",
    "I'm unhappy that this vehicle was released to the public with the frunk's original issue of potentially breaking off a finger if caught in the side while closing. I see this as extremely dangerous and yet the governing bodies decided this was not enough of a public safety issue to care. I guess now we wait for the potential lawsuits from injuries due to the Cybertruck being designed the way it was.",
    "They are not pointing because they think it's a cool car, but because they are making fun of you. The only reason it's \"iconic\" is because there is finally a car worse than",
    "The prowler is what's your name? Where are those PT cruisers at now? They were pieces of junk!",
    "I didn't want to buy this truck until watching this video.\n yep I don't want to buy this truck.\n give me a mega cab dully Cummins",
    "Bit of a Tesla fanboy, so far your only flaw. Not this video. But in general.",
    "As time goes on, video games look better. From polygon ps2 games to hyper realistic ps5 games, cars do the opposite.",
    "Do you know how to drag race? Don't start from idle when the light drops; the car should already be up in the rpm",
    "It's shorter, but it's about the length of a mid-sized F-150 model and is considerably wider. What gives?",
    "one of the ugliest vehicles ever. looks like a lazy design",
    "it looks like a refrigerator on wheels",
    "I think it's time to talk about the CEO of the company your channel covers. I strongly feel that he's undermining the institutions of our country pushing false conspiracy theories. He is on the phone reportedly with the former President several times a month now, and this person was recently convicted of 34 felonies.",
    "I heard there are bad blind spots.  True or false?",
    "You are brilliant.  You were enjoyable to watch.  :)",
    "With the A-pillar where it is, and literally zero visibility out the back and in blind spots, it's super unsafe and frustrating driving experience compared to a traditional truck design.",
    "Cybertruck is like that episode of Seinfeld where the girl looked great in one kind of light, and like a ghoul in another type of light. It can look good from certain angles, but I watched one drive past today and,",
    "Cmon man! This thing is iconically terrible. No need for a 9mm round, just take an ice pick to the side panel.",
    "There is no actual valid reason for this 'truck' to exist. There are tons of people with lots of money who don't have any common sense, and Elon decided he can make a quick buck from them.",
    "It is not a practical truck and the only reason to buy it is as an attention grabber like the Hummer H2 and H3. The only advantage it has is it being an EV, but Rivian and Ford have much better",
    "\"Never trust companies on what they promise for the future\" \"Judge the product at hand, not what they say they will do in future\"",
    "How much did Elon pay for this???",
    "When you're using the truck on set, do you park it out of the sun and clean it with the special products to prevent it",
    "If Kanye can have the ppl wear expensive homeless clothes surely musk can have ppl drive an experience refrigerator around to look cool",
    "CyberCrap",
    "Teste is subjective. \nTo me the thing is  Iconically UGLY looking Car",
    "Are cars supposed to absorb the impact when in an accident to keep the people inside safe? And not just be a huge block of metal that could potentially crush other normal cars? Am I missing something here",
    "I have just one question for you: How stupid do you feel? Now that you know what you've gotten into, how did you get into it",
    "i want this to be in transformers form",
    "i love your review, quite insightful, good Job",
    "'Physics just takes over' might imply that physics was dormant during the race. Yet, physics was at play right from the onset for both cars, evident as the motor's induction",
    "Im here because i want to see the inside of it.",
    "It's iconic, like the Edsel is, or the Microsoft Zune.",
    "While Marques is one of the most respectable tech youtubers, it's quite painful to watch this.",
    "I will never trust a computer to proxy my steering, no matter how high the benefits. I know that airplanes use the tech.",
    "I have never heard of a car having this many commonly experienced issues. It's hard to keep up with the myriad array of issues that are common to this truck, and it's hardly been on the road a few months! As they get driven more the issues just pile up.",
    "The Cyber Truck sounds like a decent machine, but its practicality is questionable. Throwing anything into the bed from the side looks impossible.",
    "I found the drive by wire steering to be the best thing about the cybertruck after driving it. It also had giant panel gaps all over and its build quality was extremely poor outside and in. The leeway given in these reviews by Marques, saying future builds will fix all of these issues, is mind blowing to me given the inconsistency in his criticism compared to other product reviews.",
    "I will always come back for more if you keep being as honest a reviewer as you have been thus far. Congrats",
    "I'm sure someone has said it before, but it's roll and pitch (not yaw). I appreciate the real world insights",
    "Anyone seen the crash test results? That its not published tells you it cant be good.",
    "This was a propaganda clip; poor all the bicyclists and pedestrians who will be harmed by this needless truck. Almost everything the host said is wrong now, just about 2 months after the clip was published. So much for using an electric vehicle to be environmentally \"friendly\"; and all that b/s about 0 to 60 or bulletproof windshield or body; what has our society came down to?",
    "24\"27 Ameribros, what is a \"product person\"?",
    "Who the hell thinks this thing looks cool? It looks incredibly stupid right out of the Jetsons or the 1982 Worlds Fair as \"the",
    "This video is not going to age well when you're calling it iconic while not engaging seriously with the information about safety issues, deceptive marketing, and low standards. This vehicle is everything wrong with western materialism.",
    "This vehicle breaks more often than a 7th grade relationship. Not to mention, the people who buy these are lame as hell.",
    "sweet, a truck that'll match the graphics on my N64. :P",
    "You can't just say that the thing sucks at towing and offroading, you also have to defend it with \"oh you shouldn't be taking this thing off road anyway\" It's actually gross, can you kiss Elon's ass any harder?",
    "I don't think it's fine that people will use these just because it looks cool. Same with all of the giant SUVs and lifted pickups on the road nowadays. This shit is not safe for my baby corolla",
    "Lol if the only positive thing you can think of is people talk about it youre not being real",
    "Cyberscam",
    "I can get the same looks and interactions in my car from the 50s. And an added bonus of old people sharing stories from back when they were my age and riding around in one.",
    "I don't know why they didn't build the doors to open like a Delorean.",
    "I think it's funny that the worst things about the cyber truck are Elon related. The insistence on the design. The cutting corners and quality control. Even people assuming you're an asshole if you drive one.",
    "I always thought they looked dumb until I saw one in person and it made me smile. They are growing on me for sure.",
    "Your entros are just INSANE!!!!!!!!!",
    "The Hummer EV is so heavy that when they ship it, they have to leave parts off of it to qualify it as light duty for shipping purposes.",
    "L",
    "I have owned two Teslas and don't find the seats comfortable for long distance driving.",
    "It is a useless bulletproof truck, which nobody will use as a truck, nor will anyone drive it into a warzone. Nothing can be iconic when it doesn't do what it is perfectly designed for.",
    "In addition to lying, could not they have just said it beats the Porsche off the line while driving? That to me is impressive enough. The fact they lied just kills it.",
    "The word Id go with ends onic but has moron at the start.",
    "I'm pissed he didn't even tell us how much it cost ",
    "YOU CALL IT GETTING CREATIVE AND I CALL IT LYING\n\nITS OBVIOUS THAT WASNT A QUARTER MILE... WTF...",
    "LOOK AT THOSE DANGEROUS, CRAZY PEOPLE TAKING VIDEOS!!\n0:30                \n* LITERALLY SLOWS DOWN TO TAKE MULTIPLE VIDEOS OF THE PEOPLE *\n",
    "I have a Cybertruck. And this is absolutely TRUE. The peoples reaction is beyond entertainment ",
    "I love my budget Rivian (Ford Maverick hybrid) until I can afford a real Rivian. I hope Tesla decides to compete with the adventure-style electric truck in the future after they are done with their statement piece.",
    "Bro I need the stainless steel so I dont get damaged if I accidentally scratch a pole, or idk get PIT maneuvered by a cop",
    "Just wait a few days; after seeing a few of these every day, the novelty is gone, and it's just ugly. \"Iconic\" design means they're not able to sell them in Europe. What a brilliant business decision.",
    "Why don't you put 3 children from age 3-9 in front of this cyber bumpster and explain what would happen if it hit one of them? Do you know they cannot be sold in all of Europe because of the pedestrian law? The US does not have this law. This is the biggest industrial scam of them all, and in 2 years time Tesla will be Chinese owned and Electric X Jesus will be broke.",
    "Most hideous design..my kid can draw a better design than this",
    "I'm not sure if you would be safe if you got into a car crash, but I think this car is not safe. It doesn't absorb the force at all. The more a car crumples, the safer it gets, but that's not the case for this car",
    "do all the straight lines make it cheaper to produce? i hope so",
    "It is a cool design which is turning heads and getting reactions from people, whether positive or negative. I'd get one if I had the money, but then again, if it's true this can get stuck in snow, that's not good.",
    "Why dont you make a video about how all evs prices are dropping specially in the used market ?",
    "This is a car for sociopaths. It will never be for sale in Europe because it is a fatal menace to others on the road.",
    "Keeping the vehicle clean is a major issue, and putting it through a regular car wash is definitely not recommended. The panel edges are dangerously put together, such that people risk losing their fingers when closing the doors and trunk.",
    "Truck? THAT bed doesnt look like it does much of any truck stuff especially if you want a spare tire.",
    "You won't be fine in an accident with cold rolled steel. That thing has 0% crumble zone because of the material. You will get whiplash to hell.",
    "I don't like the complete de-badging. They should have left the Tesla badges on the front, back and steering wheel. You can tell they wanted it to look like a cross between the DeLorean and the armored vehicle from Aliens.",
    "People are already selling these for $150,000, used. lol. That's the price of a house.",
    "I feel that you are mainly reviewing modern American culture rather than the truck. What is the actual towing or off-road capability of the Cybertruck? You didn't say, but instead essentially invalidated the question, telling us we don't care. You say it steers well, which is an actual car review thing, but never talk about the size of the bed, or the comfort of the backseats.",
    "I'm angry that I have seen nothing on that cool ATV Elon had in the back of the cyber truck for the unveiling. I thought every truck came with a matching ATV",
    "When VW bought back the New Beetle it did very well, but very briefly, and soon it becomes just last years shtick.",
    "Hey Marques. I watched this video and it's awesome ! My question is can you do one on Honda Prologue?",
    "the way you can tell the Cybertruk is an absolute joke of a vehicle is that it literally cannot be sold in Europe because it's completely unsafe.",
    "\"...while my child, I mean the car...\" it's so subtle but perfect.",
    "I'm from Malawi , Africa. I love the cybertruck n EVs. I hope one day I'm gonna afford one.",
    "Really nice to watch and very informative video , thank you very much !",
    "Cybertruck is the love child of the Pontiac Aztek and a Delorean.",
    "Different times and different vehicles but reminds me of the Hummer H2 craze back in the day,  that it would turn head everywhere you would drive it.",
    "The cybertruck copied the original hummer in some ways. It's a ridiculous vehicle and represents excess. It will end up the",
    "this reminds me to the Lancia Stratos Zero with that weird simple blocky looking",
    "Some of Van Gogh's works are worth hundreds of millions of dollars, and only well established museums can afford to own them.",
    "Tf is that pile of metal?!",
    "Tesla will get credit for inventing steer by wire, while Lexus introduced it in 2022. Four wheel steering is already available for years with Cadillac, GMC, Lamborghini, Mercedes-Benz, Acura,",
    "Cool graphics in this review :)",
    "After this genuine review, Im a little disappointed because, I WANT ONE!!",
    "Looks like old tomb raider graphics. If you know, you know.",
    "There is a reason cars are designed to be turned into pieces that only a petty narcissist will ever ignore.",
    "The man on the bike that gave you the thumb down, most likely replies that way to every single Tesla or Electric car. I can imagine biking must be better for the environment than the manufacturing of tesla's or any other electric vehicles.",
    "Wondering when they're going to start bringing these to AFRICA gotta drive this round my villageElon",
    "I think if the people got a wonderful life, they would be complacent enough for the U.S. to not prosper, but be proud and happy to produce for us.",
    "I remember steel cars with far more delicate design. Elon needed new tech to create the bare minimum, and the people are not slow.",
    "So many problems at Tesla and now the recall. Elon doing begging videos to shareholders for his 55 billion bonus. Super charger employees lay off.",
    "You skipped the truck stuff. It's not a truck for working. At least you showed it towing something. You coulda sold the bulletproof shell better.",
    "To think that there's a ton of science people that deal with automobile shapes in order to actively reduce the damage a car would do to a human in case of an accident is ridiculous.",
    "WHAT IS THE RADIATION LEVELS LIKE IN THAT EV MONSTER??",
    "I will matt wrap it as soon as this this thing is on my driveway.",
    "This is now the worst vehicle he has reviewed....makes the Fisker look like a spaceship",
    "THE MOST DANGEROUS THING IS DESIGN AND MRCHANICS, UNBELIEVEABLE YOU JUST CHOOSE TO IGNORE THAT. \nLOVE MAKES YOU BLIND",
    "people stare at this and wonder 'why anyone would buy this' not as some status symbol. I wouldn't want this shit box even for free.",
    "This guy is the sole reason for 2000 of the 4000 cyber trucks sold so far.",
    "Don't have an accident. Stainless steel panels are hard to work on. I worked for a dealership that sold DeLorean, it's a different thing.",
    "Repurpose the steel, fix the windscreen and truck bed, opt for better build quality of the body so it doesnt fall apart in water, etc.",
    "This is the same guy who didn't like the Fisker because the remote didn't work. The vehicle has been universally trashed by anyone who has used it.",
    "I hope we don't end up with millions of these on the road. They are a tangible reminder that rich humans will spend money on things they don't need, while others that don't have enough grind themselves into oblivion.",
    "You did a review of it before and it wasn't the best, according to you. Now, you're saying positive things about this truck. You've been muscled! How much did he pay you?",
    "As time goes on I just keep getting more disappointed in you. Making excuses for Elon still is depressing.",
    "I wonder, why did you (appropriately) buried Fisks's Ocean but are being so easy on a vehicle ridden with problems, like the CT?",
    "I live in LA and have seen 100,000 of these already; no one gives a crap or is impressed with cars there.",
    "Already iconic?\n\nAlready recalled you mean ",
    "If anyone wondering the music in the drag racing section is called \"Hypercrypto - Oomie\"",
    "I've seen a lot of drag races all over YouTube with this thing, but what about the agility course, or at least race track with some tight turns? There's nothing else really to learn from drag races. What I want to know is, can that 4 corner steer-by-wire system actually make up for the extra weight when it really counts, or does the Porche win on a winding road, too?",
    "This car is meant to be a fortress on wheels. It is not quite there yet, but it will be perhaps just in time.",
    "*Would be interesting to see how it looks after a crash and if you are protected*",
    "Cher bought a PT cruiser for her kid; everyone thought it was so cool. Now I think of it as a questionable car bought by questionable owners that typically drive it in a questionable manner",
    "It seems like this truck is designed for some sort of preparation for what's coming in the near future or even a social experiment.",
    "It's hideous. I saw one speeding towards me on the freeway, and my reaction was WTF does one want one of those abomination?",
    "Bulletproof skin was a side effect of the chosen material, not a feature that was planned for and added. They didn't sit in a room together and decide if making it bullet proof was worth the time to make it from that steel.",
    "I think Im the only one that thinks thats a beautiful truck for the 21st-century",
    "I thought they would try to give truck drivers truck features, but other than it has a bed, it really has a lot of limitations. Most truck people want to power their power tools, not really charge another. I'm not confident in the drive by wire feature, why? It's not great for a truck driver.",
    "i want to live in it",
    "It's funny how you say at 7:30 that people inside the truck will be fine in an accident, but it's now known that the lack of crumple",
    "I don't comment very often, but man, that's a stupid \"truck\".",
    "At 3 tonnes, it is a complete road menace to other road users. The vehicle should be built out of recycled materials.",
    "Lol idk about looking like a refrigerator. To me it looks like a door stop.",
    "this dude is a a mercenary. its incredible how people take this dude serious.. what a Prosti",
    "You're bad at reviewing cars and you don't know how to review a car. I wanted to know about cybertruck but you made such a long video that I am leaving it in the middle and disliking your",
    "VERY-GOOD EXPLANATION VIDEO :)\nTHANK YOU FOR SHARING :)\n\nTHANK YOU FROM ISRAEL :)",
    "I really hate how Tesla just doesn't care for pedestrians nor the driver of the truck. It's so unsafe for literally everyone",
    "INFAMOUS, not iconic.",
    "Marques you're iconic.... the one in billions who has such a great approach on products! You never disappoint!",
    "everybody looks at it and they say damn that thing is super ugly",
    "A truck that has less storage than most modern trucks, any older truck, most suvs, vans, and even sedans. It has horrific quality control issues, rusts if you look at it funny, and blinds people nearby thanks to it being a glare magnet. It is unnecessarily dangerous just because, and it is not fine because it looks good. It makes streets more dangerous, it makes congestion worse, it does damage to roads, and for what, it looking cooler?",
    "I swear you can't see any of the indicators from the outside, theyre all tiny bars that sunlight wil easily obscure",
    "One of the best made videos on youtube i have ever watched",
    "I think you mean ironic.",
    "Why would you want all those large flat reflective surfaces? Why not a flat finish? Will Tesla be willing to evolve the body in future or is this the \"iconic generator\" of its current appearance?",
    "Horrible",
    "Bulletproof steel may protect the people inside, but make everything far more dangerous for everyone else on the road. Touch screens are hard and distracting to navigate; it's why we are not supposed to use our phones while driving.",
    "I do not feel like this review is as honest as it should be. With a lot of your other reviews, it appears way more honest, but there are major glaring issues that aren't discussed in this video.",
    "It's not just a cybertruck thing, but I can't get over the lack of physical controls. It feels disingenuous to tout the software being in control as strictly beneficial, when in a lot of cases it's just to make production cheaper.",
    "The only features it is missing to make this truck perfect for me are a heads up display, a dong for towing, and the ability to consume gas",
    "As a tech-skeptical person, I plan on never buying a car made after 2014. The idea of relying on software and updates scares the hell out of me. I'll stick to cars that won't fall apart",
    "I find your review of the cybertruck uncharacteristically uncritical. Glossing over all the well-publicized fallings of the Cybertruck with \"what do you expect in beta testing?\" and \"trucks have been known to get stuck in snow\" is disappointing.",
    "I'm afraid the goofy design is going to set the precedence. Vehicle designs have been slowly going downhill since the 80s",
    "If I'd give a thumbs down, the main reason wouldn't be because it's a Cybertruck, but the evolution of cars getting bigger and bigger and less safe for everyone",
    "There is nothing \"safe\" about that steering wheel. There is no \"override\" or mechanical control. My old car, had a lot of hydrolic issues, and it was hard to steer.",
    "I can't believe this is the first time I'm seeing the perfect angle to view a drag race.",
    "i love the way it looks",
    "why is mkbhd wearing a shirt of something german frisbee related? i under the frisbee part but why the german flag?",
    "It's ugly. Overpriced. Impractical. Pointless.",
    "I'm surprised nothing was mentioned about safety.  Cybertruck has not been approved for traffic in the European Union",
    "It seems as if the cheapest Chinese manufacturer made a mix of glass and fake metal sandwich.",
    "I love your honesty in your reviews, but you also leave a lot of stuff out like what other people go through.",
    "I am one of those online people yet I only found out about this like last week. I don't give a shit about cars or trucks, so it's probably just my lack of",
    "I worry about people coming up drunk or while at dinner and spending 30 minutes trying to dent it because they saw online it's dent proof. Odds are they couldn't, until you get a big boy with a hammer.",
    "how tf is this a review lmfao",
    "Really interested in the potential for these to turn into like budget/entry ameteur storm chaser setups. Not that I think it's a good idea.",
    "These things are everywhere these days and I just ignore them! Make it safer for them.",
    "How can you review a vehicle and not mention safety like it's a cool new phone or gaming gadget? It's a 3 ton movable object that's gonna encounter kids on their way to school and bikers commuting in the city.",
    "When it comes to producing Tesla content, you should have your staff take the lead.  Your takes will not age well.",
    "The most overused word today is \"iconic\". This is not iconic. This is a failure.",
    "Clever instead of deceitful... Nice one Marq. You are so sold...\nYeah... Snake in the garden was clever...",
    "So in short... Perfect car for those who know nothing about cars, and those who want a clout.\nIf you like cars... keep scrolling...",
    "Damn I work at the studio they shot this at",
    "tell me you got this car for free in exchange for a biased  review without telling me you got this truck for free in exchange for a biased review .",
    "Is it ugly?\nYes",
    "The truck has the worst internal and external safety design and extreme environmental and infrastructure impact. The sheer mass of this thing makes it so insanely bad. The safety aspects have already been mentioned in other comments. I don't think this will ever be approved for EU sale with anything resembling the current design.",
    "It was so satisfying to finally see someone show the race in one shot instead of cutting out the whole time.",
    "I think its really disappointing seeing you have a cybertruck. Elon is a horrible person and you are willing giving him money to do more horrible stuff.",
    "What's the intro music song name?",
    "2:04 gyat",
    "I think you are looking for \"moronic\", not iconic. You are welcome. Its a clown mobile",
    "Cyclist will have given a thumbs down because the cyber truck requires large amounts of energy, aluminum and mined materials to build. Most people simply don't need such a vehicle, or it's simply not good for what trucks were once made for.",
    "i think it looks dope but at the same time i think its an abomination",
    "was expecting a \"the worst car I have ever reviewed, for now\" very suspicious",
    "A few things you left out in this video: The bulletproof exterior isn't just overrated, it's dangerous. The windows are stronger than normal, but they are meant to be shatterproof. You didn't mention a common problem with Tesla cars in general, that the doors are completely powered by the battery. If this 'truck' were to have this problem, how would you get out/back in? You can't get out the windows, and tow companies are going to have a hell of a time getting it to a shop of its stuck in park.",
    "There's a lot of safety concerns with a car like this. The cyber truck absorbs no force in impact compared to normal cars. It's iconic, but ugly, that's just that.",
    "I saw one yesterday. It looks weird and pitiful. It reminds me of the overated Hummer H2 when it first came out.",
    "It would be great if you did a video strictly about the towing capabilities, also the bed storage and how big it is. What kind of strap hooks",
    "I could totally see this truck becoming the new standard police cruiser specifically because of the innate bullet resistance.",
    "its actually illegal in egrmany, cause its not good enough",
    "The reasoning that the cybertruck is bad at truck stuff is not a problem because most people don't use it for truck stuff, is more an argument against buying a truck, than it is an argument",
    "At 7:30 you say the driver will be fine, but that's not true. In fact, modern cars are designed to be 'flimsy' The crumple reduces the force of a crash by having it absorb the kinetic energy of the crash.",
    "10:30  it sounds quite inside while you are talking to us.",
    "7:24 ",
    "This is an ugly car. No doubt about that. When you have to convince yourself about the looks, you know it is ugly.",
    "I love all your videos, but the top down drone view of the drag race is one of the coolest things I've ever seen",
    "From a design standpoint, it will never share the same design language as the PT Cruiser because it embodies a stronger sense of modernity. What it will become is a benchmark for future design languages that seek to incorporate the Cybertruck's form into new automotive expressions.",
    "It's not okay when Fisker releases a car missing features on launch, but it's unique when Tesla does it. Cars should all be held",
    "tell me you are an elon fanboy without telling me you are \nan elon fanboy",
    "I heard it rusts and how was the laughable size of the bed not mentioned?",
    "Can i put solar panels on it?\nCan I sleep in it? \nCan It drive it self when im sleeping?",
    "There are lots of mass produced \"iconic\" cars; 1970 Charger, 93 Supra, Citroen SM, E-Type Jag, Gullwing Mercedes, Ford GT.",
    "If the car gets into an accident, what crumples? Something has to, so if the car is not taking the hit, the only one crumpling will be the occupant inside. It's confusing and sad how many are convinced that this is the future.",
    "I enjoyed your video, the way you speak, the clearness to understand all that you say, and how informing it was. The content made me pay my full attention, and just over all I straight out liked it. You can say you have a new excited fan here, and I will know it in no time.",
    "Thought mah boi was about to pull out the blammer for a sec",
    "Everything that is wrong with the car industry, joined with everything that is wrong with the tech industry.",
    "it looks like a lowpoly prius lol",
    "I know it can race an sport car, but the fact that the rear mirror doesn't work was not mentioned in passing. I had to check Drew Gooden's video to get some actual information on the car and its surrounding context.",
    "This vehicle will be another Hummer H1 and will suffer the same fate. It will end up collecting dust on lots just like all the other overpriced, oversized junk.",
    "You can move the contents of a house with a truck; show me you doing that in the cyberCar.",
    "There's a literal 4-step process to 'shut down' your car. This is an incredibly soft review, and I think the 'typical tesla' design decisions warrant much more criticism.",
    "Being mass-produced doesn't necessarily deminish its status. The Volkswagen Beetle is still iconic.",
    "It's a shame I hate everything else about the Cybertruck. Here's hoping we get a practical vehicle that has 4 wheel steering in the future.",
    "I thnk it is more unique rather than iconic.",
    "I love it, but I'm not gonna get one until most/all of the bugs and issues are fixed on it. I think this style would look awesome on a sports car, and when I get the money for it.",
    "And here I thought the most dangerous thing is its rigidity and lack of crumple zone",
    "This thing is a beast... Love it.",
    "You know who this car is for? Divorced, middle aged men trying to impress their daughters underage best friend.",
    "It gives you eye cancer! It starts rusting the minute you use it on the road. It may cut off your fingers if you're not careful.",
    "Really disappointed and concerned you didn't mention the safety of this thing",
    "Id say it accomplishes its desired design very well but I dont like the design they picked",
    "The first two years of owning the reissued VW Beetle in 2000 was annoying. I got so sick of people talking about the car. It was easy to find in a parking lot, though.",
    "Watching some of your other videos are the whole pin debacle.\n\nThis felt like a paid advert in comparison.",
    "You have a good speech dude! So auditive ",
    "This stupid soda can is not worth one Dirty Dime  Elon Musk stop making Useless overpriced crap OVERRATED!!!",
    "The most iconic part about this car is getting humbled off-road by a little Subaru that costs 1/5 as much. The subaru is safer, too.",
    "The PT Cruiser also retailed for around 25k brand new, and I can't see a lot of people getting a Cybertruck being",
    "Wasnt there a crash recently where the cybertruck was fine but the occupant was badly injured while the occupant of the other written-off car was fine?",
    "Well this didnt age well, did it?  ",
    "I am so glad these aren't in Australia yet",
    "I think it looks rad.  Esp with the wraps like the Black Wrap is sweeeet!  Straight up cyberpunk.",
    "In my opinion I wouldnt call it a truck. Id call it an over glamorized hatchback, but I do respect Elon for being unique.",
    "The energy will not be absorbed by crumple zones as in a normal safe vehicle, so it has to go elsewhere. You won't fly out the windshield, but you will be hit by a giant hammer which will snap bone and crush organs.",
    "Ahh shit, he brought the 911 out! Lol",
    "Dude never seen you before. \nVery objective, friendly and honest.\nGood stuff",
    "it is really iconic like something humanity should never done again.",
    "A car that cant crumple or release energy in a head on collision is more dangerous than anything in the road",
    "iconic for being a strange and nonpractical piece of rust",
    "Every feature listed as a plus for this vehicle only exists for cost-cutting purposes. This is a reckless endangerment machine, not a car.",
    "People that thought that piece of shit was worth 300k are also the same people that think a red Camaro is a Ferrari.",
    "You spent so much time talking about a truck going faster than a sports car. Why? Like, I like apples, but I don't need an apple that does my taxes. A truck has no business going that fast besides nerds in a lab and showing off to their tech friends.",
    "What an incredible review. Loved the production. Dont care about the car but still stayed until the end.",
    "How's it iconic?? Just looks like some old 1970s design for the future??\nBasically trying too hard",
    "Cybertruck stands to act as a death trap for drivers and passengers inside. 100% of the energy will be transferred directly into the occupant and accelerate through the windscreen.",
    "The real reason most people buy trucks is to boost their fragile egos and bring a false sense of meaning to their lives. I pitty truck owners.",
    "oh god... people really do be living in a capitalist hellscape",
    "After watching this cybertruck ad disguised as a review, people should go watch Drew Gooden's video about how dumb cars have become.",
    "Watching this after having watched Drew Gooden's car video makes me feel a little deceived since you glossed over all of the problems with the cybertruck",
    "If I were Fisker, I'd be suing the shit out of this guy. Leaving a massively negative review of the competition while getting free cyber trucks directly from the company? Basically making an advertisement for the horrible",
    "How bias is this guy. Look at the ugly truck and he can't decide if it's good looking or not. No objectivity. ",
    "Turdmobile",
    "4:49 No, Lexus was the first.",
    "if this looked more like a 73' skyline and was cheaper i would be totally sold. for the aesthetic and for its size",
    "Designed by a 7 year old with a ruler and #2 pencil.",
    "What about the new water ingress issues with the infotainment system? Maybe an update?",
    "I had a hire car in the USA in 2001, a Pontiac Aztek, and just as many people approached me, shouting 'I love your car!' at the traffic lights. For at least 99% of buyers, there is no real reason to own this car. I think it's cool and I'd love to drive and own one, but it's just nonsensical.",
    "I don't know if I like it or not, but I'm not going to judge a vehicle before I even drive it. It's just a vehicle.",
    "I live in LA and I've had maybe half a dozen sightings over the last couple months, but nobody has thought of that idea.",
    "For we in Europe will be really rare for a long time! (They dont sell it here)",
    "A joke on wheels turning heads doesn't make it \"iconic\" The video has me hitting the \"don't recommend this channel\" button.",
    "Great review, in depth and well done. Agree with @kugelblitz2001!",
    "I'm not a fan of tesla, but as a cyclist I'm happy about every person not driving a gas fueled car with exhaust fumes",
    "You were way too easy on this vehicle. It's poor for towing or hauling over even moderate distances. It only comes in a bed variation so small you can fit almost nothing in it.",
    "I love your videos and have grown up watching them. The writing, the music, and the cinematography is amazing. But I can't help but notice your avoidance to talk about the real safety issues of the Cyber truck, in more detail.",
    "I don't know what it is, but this seems like an effort to shift the blame away from a very ill designed car with a huge amount of hazardous errors and bad design. The way it makes other people behave has nothing to do with how it blinds them. The amount of many design flaws, accumulated to make it much much worse, shows you have no concept or idea of what makes something bad.",
    "Marques is trying so hard not to mention negatives, dance around previously mentioned points, and do his best to stay on course.",
    "This poor excuse of a car is legal to own? Remember US banning pop-up headlights because of \"pedestrian safety\"? Yeah. This car is a bad joke in almost all aspects.",
    "The body of the car being of a harder, non-bending metal makes the shockwaves of impact propagate directly to the occupants without any dampening, making collisions way riskier to the life of who's inside.",
    "There is something genuine about Disney and Marquez that makes this collaboration complete. I can say this about him and Tesla too. Does Elon pay well to be a Tesla fanboy?",
    "All the pedestrians getting sliced in half by this thing are gonna be hella iconic",
    "I can't get past this thing not having door handles. It's a huge security risk if someone ever slips off the road into a body of water. How would anyone rescue you",
    "The only opinion that matters is yours.",
    "If I wanted a truck, this would be the last thing I would consider. There is literally nothing that appeals to me about it.",
    "This truck is like the new hummer. Garbage vehicle thats too expensive, but douchebags will still get it so they can run you off the road.",
    "It is definitely an SUV. The word \"truck\" is just a marketing thing. It is amazing how you can get people to imagine things that aren't there.",
    "I live in an area with a lot of rich people, and I'm not excited for my schools parking lot to have some of these. Some kid already drives a hummer and has almost run me over twice. I drive a tiny Hyundai and",
    "It is sci-fi and and yes, downright futuristic and amazing. It is like Mad Max X type of thing. I also feel it would pop out wings and fly off the road.",
    "LEGO",
    "Seen it in person and definitely was not impressed.",
    "Thank you for the explanation on the quick vs fast, hope more people will understand the difference.",
    "It is not even a truck. It gets beat by a suburb off roading already. It's a joke.",
    "8.7% Dislikes on this video with 3.2M Views...wonder what that means?",
    "The finish is so so bad.",
    "Iconic, like Trump's hair. \nDoesn't mean it's a good thing.",
    "Okay, how smart is this guy?",
    "I had the first Rivian in my state, and the amount of people who would speed up, block me in, take pictures, and just act dumb around the truck was insane. It's not just the cybertruck, its any unique looking vehicle.",
    "Can't believe he went with the Back To The Future Guitar Solo argument to defend this meme on wheels.",
    "Waiting for MKBHD to make it Matte Black.",
    "If you want to wash the truck and you forget to put it in \"car wash\" mode, it completely destroys the vehicle and isn't covered by the warranty",
    "There's no reason for most people to have this. It's unsafe for other drivers and pedestrians, especially since it's a very fast and rigid structure. Also, you're filling the pockets of a white supremacist.",
    "I'm having trouble deciding if it's more or less responsible to review the Cybertruck with or without discussing Elon Musk's problematic socio-political issues. The reason I would give a thumbs down to a Cyber truck isn't that it's not interesting or even good looking, but that I can't support a man like Elon Musk.",
    "I have no idea how this is legal in the US. What about the rust issues, gas issues, and the truck not working after a few miles? Why not try to go offroad?",
    "I found it a bit problematic, that you looked at it more one sighted. The interior is in a very low quality style, the steal gets dirty and rusty very easily, and buyers have a lot of restrictions with how to clean it and how often.",
    "The design stands out, but for all the wrong reasons. It's an SUV in a shape of a truck, it's bad at everything that a truck should do, it has shoddy build quality, almost all controls are on the touch screen making it very distracing for the driver.",
    "These have proven to be unreliable, crappy build quality, low resale value, un-practical and poorly made machines with lots of problems. My son's drawing would then be a master piece.",
    "Iconic for being the worst  truck ever built? Sure and thats about it, but glad to see you are still selling out for checks.",
    "This tells me everything about the state of marques now. What a complete sellout.",
    "Thats just the copium. Itll wear off. But no, its not iconic, unless it becomes iconic for kluges.",
    "For a channel that's recently under fire for being \"too critical\" of a product, this review seems oddly... biased?",
    "Can you imagine the damage these things are doing to the environment? Why do people need a truck for normal every day use? How stupid must one be to even think of buying this?",
    "From the testing that's out and the recall that's in it shouldn't have been legal. You cannot beta test on the general public with a car.",
    "One of the biggest things it has going for it in terms of actual utility and tangible capabilities is actually the bed and cover, so I'm disappointed to see that omitted.",
    "Look, I am really sorry: If I wanna have stainless steel, black plastic I would buy a DeLorean.",
    "he said it had low headlights that arent in peoples eyes but i swear i literally watched a video yesterday bringing up how they shine in everyones eyes at night",
    "I am happy its not allowed in the EU because it's sharp edges and no crumple area if an accident happens. I fear you get blinded because its stainless steel",
    "Last week I was IN the Truck. NYC 6.  Av. Creazy. \nGreetings from Germany/ Porscheland ",
    "Its still not gonna be common because most people cant afford even a $30k new car including myself. This things $80k plus.",
    "Anyone else getting a some anxiety when he was closing the door? That steel could REALLY mess up someones fingers if they get slammed on.",
    "Of all the trucks / SUVs  on the road this has got to be one of the ugliest looking designs out there.",
    "At least you still have all your fingers.",
    "I stopped when the door broke. If you can't make a door right I won't trust my life inside this car.",
    "I don't hate the back, and I don't not like the front, but the side is weird to me. The way that line is closer to the front wheel arch than the back just looks odd to me; also, you'll never see one of these with a cherry picker boom arm in the back; and you won't see one in the frozen areas of the planet because they don't work with thick gloves.",
    "Any reason you took so long off the mark, MKBHD? Is this your way of making things interesting? By taking a few milliseconds after the Cybertruck before accelerating from a",
    "You called the Fisker the worst car you've ever reviewed, but here show that Tesla screwed up the door latch. I hope you keep this video up, because when these over-priced loser-mobiles look like they belong in a post-apocalyptic trash heap, you may be the worst-reviewed reviewer that people have ever heard of.",
    "It changes your steering based on your speed? That sounds dangerous. This isn't a phone or a new way of making fruit smoothies. Cars and trucks are heavy machines, and if they don't respond properly, someone could get seriously hurt or die.",
    "This is iconic of Elon Musk's arrogance and how much it's going to cost Tesla forever. It looks like something they had to throw out after making some stupid sci-fi.",
    "Just saw one of these in Saint Louis and was so confused at what I saw lmao",
    "The stark contrast between this review and Fisker's review is kinda sus. Very curious how a review of BYD would pan out on this channel",
    "What that person said about the TP Loser is absolutely untrue. The Prowler looks like an alien spaceship still today. Never on its best day would anyone take a beat to acknowledge its presence.",
    "I'd never buy this, and overall if someone wants to buy it, I don't care. It's actually great, because it tells me a lot about that person. I now know to never lend them money, because they have poor financial literacy.",
    "Damn these videos, so good.",
    "I have seen a Cybertruck exactly once, and sure enough, I ogled it at the gas station and ended up having a conversation with the owner and taking photos with my family.",
    "Okay.. so what happens to other people you hit? They just die?",
    "The Cybertruck even being in the ballpark of a 911 is insane considering its size and weight. But it beats the 911 at 0-60, the speeds that matter to typical drivers on typical roads.",
    "This is more of an advertisement than an unbiased review.",
    "I feel like people who like this truck don't realize how bad it will be for people walking in cities. When he brings up one person vs four people being unhappy to happy, he isn't recognizing the context of people who don't have to worry about the car vs people who are in a box of steel.",
    "I still think ZZ Top made the PT Cruiser as popular as it became. Not that they endorsed the car in any way, it was just how iconic their own logo with that vehicle style was.",
    "Holy shit, is that The Stig?",
    "He's OK with all the bugs and negatives about the cyber truck including a safety recall for all of them. But he basically destroyed Fisker in their infancy over software bugs. How much was he paid? We'll never know",
    "After a year if you have a negative kWh credit, it just vanishes into the ether. You function like a tiny power plant for the company, but you don't get paid the overproduction.",
    "Safety concerns weren't brought up about poor crumple zones, doors that can maim you, or how much momentum it carries, so that anyone hit by the truck would suffer much more damage",
    "Wait, so half a turn of the steering wheel will result in different reaction at low speeds vs high speeds? Am I understanding this correctly? Because it sounds really",
    "A real vehicle, or any other not electric vehicle, will still work perfectly fine in five years. There are cars from the 1940's that even today work perfectly; now this battery toy? In 5 years it will have 50% battery capacity if you are lucky; or your 5 year old cell phone or lithium battery drill still holds full charge in his battery?",
    "A mass produced vehicle will look different when they are everywhere. They might start to look like clones in those science fiction flicks. I have the feeling it won't go this way with the Cybertruck.",
    "You're right it's overrated having bulletproof panels, but some vehicles are upgraded to bulletproof by custom shops. It makes no sense to invite people to shoot at your truck.",
    "6:44 Brownlee is not a small guy. But the Cybertruck sure makes him look like one. Wow.",
    "Most people who hate Elon have no reason, are misinformed, and are irrational. Elon could create nuclear fission and take us to the moon and Mars, and there would still be people shit-talking him and irrationally hating him.",
    "A car you love but you think you can't buy because you don't want to be robbed.",
    "I like the hummer, but it's a waste of resources. I have wanted a Toyota since I was 9, and I don't like it at all.",
    "You can tell that Marquise is not really a car guy. History is littered with iconic, mass-produced cars.",
    "if the icon is of a shallow human with dispensable income, then yes, yes it is iconic",
    "Minecraft the car - best features are the recall; and car wash mode or bust.",
    "it won't look so great when it rusts in less than 30 days because they don't treat the steel",
    "Awesome, You was at Island dragway, NJ",
    "It's literally a meme car for YouTubers and people with more money than sense. Nobody who actually cares about value for money would buy it. It's not even likely to be street",
    "Maybe being a YouTuber with 19 million subs affects how people look at you.\n\nJust a little.",
    "Most iconic thing about this vehicle is steering failing just after 14 days of delivery. What a POS.",
    "The truck doesn't do anything they said it would do, and if you wanted to do that, you'd have to pay extra. The truck isn't really bulletproof; it goes through-and-through both doors.",
    "iconic? yes, iconically dumb, iconically unpractical, iconically bad.",
    "I love the variable steering rates and the haptic feedback, but what happens when the car is old and it fails? At least with a mechanical steering wheel, any failure is likely to be a progressive failure that will give you forewarning.",
    "Cars that crumple absorb the energy of the crash. A hard material means the energy is transferred into the passenger.",
    "Its like the shudder you get with a tequila shot. So wrong, but somehow so right.",
    "It would be a big surprise to see a Cybertruck on the streets of Jakarta, Indonesia, but I would not rule it out.",
    "I had the pleasure of being taken for a short joy ride in one by a friend of mine who works for Tesla, and holy crap it was cool. Obviously not for everyone and that's ok, no car is for everyone.",
    "People calling the Cybertruck ugly has bias against it. People who don't know a thing about Elon, Tesla, and EVs simply find it interesting, like something out of a sci-fi movie.",
    "With the amount of gun violence in america, the bullet proof is actually under rated",
    "This aged like milk. Can we still trust any of your reviews ? Are you just a paid shill for terrible and dysfunctional products ?",
    "Thought you were going to say the accelerator pedal at the beginning.",
    "It's possible to be iconic and mass-produced. The Mini, the VW Golf, even the F150 are all iconic.",
    "After all these years of getting calls from people asking if my refrigerator is running, it's running and it's quick AF down the 1/",
    "Ok, but i will wait for a NotJustBikes review on the Cybertruck.",
    "never once in my life i want to take pictures of other people vehiclei would just look at it,admired it and moved on",
    "There's a lot of things that you left out of this review that make it feel like you were intentionally going soft of Tesla for one reason or another. The stainless steel panels rust very easily and the panels will start to change colour if exposed to water whilst in the sun. For a truck it has a very tiny bay, no bigger than the average Suzuki light truck. For health and safety reasons it is irresponsible to not accurately communicate how much of a bruising and cutting hazard the sharp steel edges of the doors are.",
    "This thing is dangerous, ugly, and unnecessary. It doesn't bring anything new to any market. It's just a funny looking wannabe tank.",
    "I'll be the next cyclist giving you a thumbs down. This truck and others in its class further endanger pedestrians and cyclists, all for \"the design.\" It's disappointing seeing someone I look up to praise a trend",
    "It is iconic, in that it's a marketing gimmick. It honestly just looks like free advertising on four wheels. But good on them for releasing a concept car into the wild. I'd like to see that more often.",
    "I have something to show the die hard truck buyers when they say I'm lying about people rarely using a truck for its intended purpose.",
    "I replayed that intro way too many times. Felt like I was watching an NFS cinematic",
    "People reporting that they got 2 hours, 2 months, or who knows how many hours out of this thing before random problems with the digital electronics bricked it.",
    "Iconic they are already on the recall list, iconic more like ironic.",
    "I am sad to say I have had to stop watching MKHD because he is sadly very out of touch with day to day people. And reading the comments, it seems like he was very positive to a concerning degree in this video. This truck has an immense amount of problems.",
    "I love when you comment on how finger-printy something is. Such a 1st world non-issue to come from years of reviewing cell phones.",
    "A YouTuber complaining that they get talked to by strangers. Sure. Most people would welcome the attention.",
    "I think the majority of people taking pictures of the cyber truck does it because they think it's cool, but also because it stands out. I think its the same reason people overestimate the price. They think its a limited run car, which it is because Tesla has not been able to make more than 4k of them.",
    "if I had a Cybertrk, first thing I'd do is take it to a shop to have it wrapped in that bedliner shit lmao",
    "The Cybertruck will be a collector's item by early 2025 when everyone cancels their orders because it's a $100K disaster.",
    "There's already too many SUVs around here and it's honestly becoming a problem on the road and in parking lots. The tech and design to make it functional is cool, but I don't want to see one.",
    "The Cybertruck is a tech demo, not for consumers but for manufacturing. It's to Model 2 what Model 2 was for Model 3.",
    "Fisker: \"This is the worst car I have ever reviewed.\"",
    "I still find them interesting to see them in the wild. Same feeling as the PT Cruiser I had when I was 12.",
    "The recall of every single Cybertruck forced Tesla to reveal how many they have delivered to date: about 3.5k.",
    "Thank you for not pandering, but telling it like you experience it. These tech companies consider your input on future updates.",
    "A massive bulking truck made of steel is faster than some sports cars. It's about to be in the hands of millions of people who have never driven a truck before. It sounds like a lot",
    "Wanker thst u had to raise the issue of the striker.",
    "\"If someone hits you, you'll be fine.\" No, the truck will be fine, but you'll probably have lots of broken bones.",
    "Iconic? Yes. \n\nUgly ? Also yes.",
    "The Cybertruck is a joke. It is not really functional as a pickup truck. It's just an SUV with a weird compartment for a backpack. I think it will be discontinued within five years",
    "i think the biker used a thumbs down bc he didn't like the thought of being sliced in half by a cybertruck",
    "I am an ER nurse and bike rider.  I PRAY FOR CYCLISTS.  :(",
    "I don't think the Tesla ad was a cyber truck vs a TURBO Porsche am I wrong? Wasn't it vs a base 911?",
    "Arent cars supposed to crumble on impact to have the car take the force and not the human?  THat seems dangerous with major collisions.",
    "I only have one consumption. If the truck flips over, and the driver loses his motivation, how could others help open the",
    "Um, that's not a truck. This looks like bad origami.",
    "Just don't wash it on a sunny day....",
    "iconic for just how bad it is lol",
    "This video seems to be a paid commercial ",
    "Gaff tape holding your $100k car door on is insane. I can't believe the video didn't stop there. Are you driving on public roads with",
    "It is a unique truck. But it costs twice the price of a Ford Lightning and offers less functionality.",
    "It's a neat vehicle with interesting features, but it's not a truck. It's more of an open air station wagon.",
    "I would never buy a tesla product because of my thoughts about Elon.",
    "You know looking at that truck from the side it kind of looks like it was like a B2 or some kind of stealth vehicle trying to create",
    "What the hell is the point of very high acceleration in a truck? Are people competing in drag races with these? If not, why even talk about stuff like this? What an idiotic, uniquely American vehicle.",
    "Cybertruck has already had a couple reliability and safety incidents. Hopefully the gaps and pedals can be addressed as it opens the field for competition.",
    "I don't know if you can really say people's reactions are still the most dangerous thing about the Cyber Truck anymore.",
    "I just got a new Crosstrek and the other day a lady at a red light rolled her window down and pointed her phone camera at my car. I was like yeah you get a",
    "It's robust, it's definitely ultra cool",
    "I ask myself if people are going to fall in love with the vehicle, not what it represents, but the look of the vehicle itself. Strip away the novelty of the angles and profiles, and no one will call out the shape of that rear end as their inspiration for a new vehicle. The classics are cars that kids today still long for and dream about when they've seen them.",
    "Its iconic in the same way the poop emoji is an iconic way to illustrate human shit",
    "NaICe",
    "And all the redundancies to make it safe citation needed",
    "It is the only milk float, sorry car, that has had all of its production recalled. It is just an aesthetic inconvenience. Nothing to see here, move along.",
    "Sorry...people need their heads read to want one of these.",
    "I fear that this \"You'll be fine\" means the person who hit you will not be. Safety features of a vehicle are here to minimise damages to other vehicles and to human beings.",
    "Comparing that Tesla thing to a PT Cruiser with a $16K base price is a stretch. Nothing that man says can be trusted. The vehicle may have some fetching features but latching hardware falling off? Not good. Recall of 100% of these trucks due to accelerator pedal experiencing rapid unscheduled disassembly.",
    "There is so much he brings to the review that just a review",
    "I've seen one in Dallas. It is hideous and ridiculous. I want to know how much Elon paid you for this video because I didn't stare at it.",
    "And omg, yaw isn't what you think it is. We can't be taking a tech influencer as a car reviewer now",
    "Is this an ad ?",
    "There's a marked personal bias in favor and occasionally against brands that contradicts that video. Don't call yourself a reviewer please, be the influencer you are.",
    "I can't believe somebody bought one of those. Is that even a real cybertruck? It looks like a knockoff. I'll take a picture.",
    "Nothing wrong with just driving your truck on the street. Dont let anyone tell you otherwise.",
    "I forget that truck exists until I see them every once in a while. It does remind me of the El Camino. Aside from that, I don't have much to say,",
    "I like the look, but I don't like the truck not working and the right way and issues. It should not have taken this long for a truck to be made with all the tech we",
    "With that wonky accelerator, it's probably not wise to drive and film. You'll be safe encased in steel, but maybe not the other driver or",
    "I can understand people shilling for corporations and billionaires, but supporting anything that Elon Musk does is like supporting Ted Faro from Horizon games. I was at least expecting neutral-adjacent review, not a promo for this useless shoddily built toy pretending to be a truck.",
    "Am i the only one who notice the German Frisbeesport Association shirt at 17:17?",
    "suck suck",
    "13:38 the 911 isnt the fastest Porsche though lol. Lets see it go up against a GT3/RS ",
    "The design is futuristic for a 1982 cyberpunk artist, but it's not futuristic now. It's nostalgia for kids from the 70s and 80s.",
    "The Cybertruck did the impossible. It made the Honda Ridgeline look more like a truck.",
    "I think he glossed over the safety a bit too quickly. I don't think you, the driver, will be fine either. And since the people outside won't be either, you may want to be extra insured.",
    "So how rusty is it with all the steel around?",
    "Said it once Ill say it twice iconicfor its flaws you are too charitable to this brand",
    "I feel compelled to say that's a superb video, my friend. Everything from audio quality to image composition, script, creativity, and the race are all captivating. I intended to watch something else, but instead sat forward, glued to every second of this piece.",
    "I don't understand his level of commitment to tesla when he said he might be first to give steer by wire. Steer by wire existed long before even he or me was born.",
    "I definitely saw you out in the city the other day drove straight passed me. I couldn't believe how big this truck was. It was amazingly",
    "If that thing hits my little Chevy Bolt, I and my kid are probably dead, or wishing we were. We're creating a vehicular arms race where buying a bigger car is as much a self defense consideration as it is anything else.",
    "Marques, my man, you're using gaff tape on a 100k car. Stop coping. Lost my respect sorry.",
    "Great review! Love your content Marques. Keep up the good work!",
    "It took 4.5 months for Tesla to get 3,787 cars out the door. Either they can't make them, or people are not buying them. Either way, they are losing money for a production line that can only produce 1/2 of Tacomas sold in 1 months.",
    "Quick: from Old English cic - alive, live, living, and intelligent, mentally agile, keen. \"The quick and the dead.\"",
    "I never thought I'd see a car that would give me flashbacks of the greasy sink I used to wash dishes in as a teenager",
    "Can a Cyber truck beat a 911 on Willow Springs? Probably not, but certainly not in a 24-hour race.",
    "I cant get over the feeling this is just a gimmicky looking, shoddily put together toaster. To me it's iconic for all the wrong reasons.",
    "I think the cybertruck will get reactions regardless of production. People still freak out when I open my falcon wing door on my X.",
    "Saw one of these in person a couple weeks ago, they're fucking hideous lmao",
    "I just saw two of these in Long Beach and people were definitely rubbernecking to catch it. It's just so bizarre and hyped up.",
    "I already see so many teslas on the road now, the cybertruck will just be yet another one. I've also started to notice the newer tesas that",
    "A stuck accelerator pedal has prompted a recall of over 3,500 vehicles. This is a novelty now, but it will cause an accident due to the distraction it causes others.",
    "It's the most stupid car design ever, like a kid drew it. It doesn't work as a truck because you can hardly use the bed, it does not work off road and it has serious build issues. It won't be allowed into most countries outside the US because of the sharp",
    "Elite vid, thanks. \nGot my order in...who knows when they will land in Australia? 2026?",
    "A truck that isn't suited to actually use as a work truck is sad. A truck that has built in hazards for kids or the clumsy is dangerous. Without using it, you void your warranty if you take it to the car wash.",
    "The most dangerous thing about this truck is the petal getting stuck. AND its NOT A TRUCK!",
    "Iconic like a Delorean but not cool...all the gushing and like major design flaws, 100k junk.  Why do people fall for the lies",
    "It would be perfect to create law that limits the dimension of cars for those who have to go only to the grocery store, but no, America is about freedom! Same for guns and single housing system.",
    "I only recently found your channel and was thinking this guy is really honest and trustworthy with his reviews. However, now I am questioning if I can trust everything you said in your other reviews. Do you really want to ruin your reputation as an honest reviewer over this thing?",
    "Some hail its innovative approach, but others question its practicality and aesthetics.",
    "Thank god that this dangerous monstrosity will never be sold outside the US.",
    "Its not that practical, quality severely is lacking, and it's not cheap at all. It will age terribly, and maintenance will be very costly. It's like owning a used Range Rover - you know it'll break, but at least you get luxury.",
    "It's been three weeks since release, the novelty is gone. You're sitting at a red light, and the gaps in the doors look off, but the rust on the front of the car won't go away. You think you saw a group of teenagers make fun of you earlier that day, and you're now 100,000 dollars in debt for a meme.",
    "Bro I have seen 10 in the last week ",
    "Seen a few. This is the dumbest looking piece of metal on the road. Ill be glad when they are gone.",
    "Knowing how Elon runs his businesses, I would never trust that steering wheel. One minor bug in the sensors and codes that it uses could turn into you doing a 90 degree turn",
    "I've seen one a few times where I live in Florida, but I won't give up my 99.3 for one. Salute to Elon Musk. It may be ugly, but dude is changing the",
    "I wish every car had a steer-by-wire system like this. Having to crank the wheel around multiple times just to turn at low speeds feels like the most unintuitive thing ever.",
    "I thought it was crappy at first, but after seeing it in real life and sitting in the driver seat, it's a god damn space ship",
    "Im just loving the visual of this video. Really an awesome review as well, as per usual!",
    "yap yap",
    "Do iconic items rust when left out in the rain?",
    "12:33 can someone explain to my why people should air down the tires?",
    "I like it manly it reminds me of Total recall from the 1990 !",
    "I believe it is pretty ugly. It is like the DeLorean 2.0 at this point, so yeah, it is iconic, but it isn't pretty. It has a lot of hype behind it, so it will probably sell well despite its questionable look.",
    "The only people that aren't morons buying this car are rich people. Imagine trying to get anything repaired on this car. No one will want to touch it.",
    "I'm really hoping Toyota and Lexus pull the trigger on their electric line up. Their electric sports cars they revealed a while back looked amazing!",
    "You selling chevron hoodies and getting free 991 just sold yourself on being a propaganda machine for big oils. Your review loses credibility.",
    "This is so called a beauty at the second sight. The more I look at it, the more I like it.",
    "Marques is bought and paid for by Tesla. I am saying this as a Tesla owner myself , but the Cybertruck is a POS.",
    "13:55 Ok that was pretty epic lol. The kinda things reviewers should do if they have money to flex.",
    "It seems like 95% of people who ordered one, haven't gotten one or haven't received what they ordered. Let's not bring the Roadster into this either.",
    "I personally like the PS1 graphics of the cybertruck",
    "If I had one, I would paint it black.",
    "I have definitely seen at least 10-15 cybertrucks in the last month. No Veyrons or Countachs lol.",
    "A review of a stainless steel truck from a guy who can afford to have some slave wage labourers cleaning it after every drive seems, welp, kinda irrelevant to my life, to be honest.",
    "Lexus was the first to get steer by wire right. Not Tesla.",
    "Give me a Porsche GT3RS, Targa 4S, or Turbo S over Teslas every day. I know it's cold outside, but I'm just curious.",
    "I wonder how much MKB got paid for this ad.",
    "I am wondering if this is a paid ad directly from Elon. This video is worth at least $5 million.",
    "I'm disappointed in this review man.",
    "If the $700 AI pin was made by Tesla, Brownlee wouldn't have said it was the worst product he has ever reviewed.",
    "As an experienced industrial designer, I can tell you this is just a gen X fever dream. Dieter Rams enlists 10 design principles, one of which is \"Good Design is as little design as possible\" Pedestrians or other cars: Let's place a sharp battering ram on super fast motors and make it heavy AF just because we can, and we'll add (now deadly) autopilot because we're invincible.",
    "I refuse to believe he truly thinks this truck is worth 100k with all of the bad programming, build design flaws, and plastic accelerator / break pedal covers that pop off and get stuck under the pedals.",
    "Wouldn't its exterior being as strong as it cause more concerns for the person inside the car? Since there is less overall shock absorption.",
    "lmao just because hes buddy buddy with Elon, suddenly Cybertruck review gets a \"Iconic\" tag in the video title",
    "The PT Cruiser was probably the first successful modern car to have retro styling. It's still one of the best.",
    "The Cybertruck provides a lot of go with its show, so it should remain \"iconic\" a lot longer. The VW Beatle is a better comparison.",
    "I just want to say sorry to all the people I stopped in traffic to stare at this truck even after I had already watched this video. ",
    "Can you store a bike in its tray?",
    "After watching jerryrigs review of the Rivian I wouldn't touch this thing with a ten foot pole",
    "The way things are going in west coast cities, bulletproof for 9mm sounds like a great idea. Not worrying about rust is killer. If you actually use a truck, you know that real life damages paint.",
    "Stepping out of this car would be like being hauled to a busy street in a bathtub, and having to step out of it naked. At least that is how Europeans feel.",
    "Iconic failure. Its up there with the DeLorean but not as cool.",
    "So many of these on the roads around San Diego at this point, definitely eye-catching for its novelty. It strikes me as more of a marketing effort than a consumer",
    "That is NOT a \"truck! A truck has an open bed with cargo capability. I'll call it a cybercar. Ridiculous!",
    "The original concept looked good, but the real thing is comparatively underwhelming.",
    "I live in Mesa, Arizona, and I've seen a lot of people using the cybertruck to tow their boats to the lake. I think that's about the only towing use case where the Cybertruck excels.",
    "The pace of this video was really fun. IDK why I enjoyed it so much, but thanks for the entertainment and information.",
    "The Cybertruck is the new Mid-Life Crisis cry for help and desperate bid to be relevant. It's like a 2006 Honda Ridgeline drawn by a 4 year old made by a company whose grifter CEO acts like a 5 year old. The actual utility of it is laughable because it has low towing power, you can't fit much in the bed, it has difficulty going up inclines that climb with ease, the range is significantly less than advertised, and it needs to be cleaned off shortly after getting wet.",
    "Tesla is not doing child labor. They use kids and adults to mine for cobalt, gold, and other materials used in electronics. They pay them with nothing. Companies like apple, Google and other tech giants do the same thing.",
    "Musk is a terrible CEO and an even worse human. As a Tesla owner myself, I hope the CT helps pull his company under.",
    "This car doesn't seem to have a crumple zone. How does this fare in a crash?",
    "Haha please dont mention a countach or veyron in the same sentence, bro, thats a joke! ",
    "A show did a race with a Model X towing an Alpha Romeo while racing an Alpha. The car being towed beat the car being driven.",
    "People who don't know much about drag strips wouldn't know that it was actually a 1/8 mile race. I like Tesla because they are good products, but they don't need to resort to false",
    "With them saying its bullet proof Id be more worried about people taking pot shots for fun. ",
    "Unfortunately you are a fan boy.\nThis is dangerous to everyone else",
    "It's ugly, impractical, and really not a truck. Some people said it was cool, so people started to like it.",
    "Listening to this video, Im 04:20 in, and I just saw my first Cyber truck on the road. I busted out laughing at the irony.",
    "I am curious as to know the price of repairing the truck. Due to the massive single panels, any damage would require the whole panel of steel to be replaced.",
    "I gotta give you props for the timing of the ads",
    "I don't know if I love the variable steering. I understand why it's there, but do you still have the ability to make a sharp turn? Like in the event a semi dropped something on the road and I had to swerve to avoid it,",
    "The acceleration pad is sliding and wedging into the footbed. Team America would love this truck by name.",
    "You all bought the prop truck from the video for California Love.",
    "The starting price for a cyber truck is only 81,000 dollars. It's cheaper than a lot of ultra beefy trucks I've seen, and it's not very big.",
    "When the Model S first came to Europe, everyone had to take pictures of it. It was definitely its own celebrity, just like the",
    "I imagine it will do the same as other Teslas. People were in awe of my future tech when I had my M3P in 2018, and asking for rides when going through the drive thru.",
    "If companies don't want a bad review, just make a good product. It's not that complicated",
    "It is another DeLorean. Sure people will think these are cool, but wait five years. Cause it is an Electric car and people will look at the price of the battery's when they have to replace them and be like Hell No.",
    "In the age of mass information, nothing material can be iconic. Only if you are considered a true genius in those 3 life aspects, you can become a true icon. The future of the human kind doesn't rely on how popular we are, it relies on how sustainable we are as a society. The idea to make the people good hearted and educated, the society to be sustainable, is what keeps the ICONS alive. Everything other lives quickly and will be forgotten within a few decades or centuries. The Cybertruck will be just a cool truck with a cool story in 10 years, but Elon Musk will be considered as a genius even after 100 years. It is impossible. The money are the God of the Internet and \"in GOD we TRUST\" (TRUST not Believe). The Saint halo is a verified badge. That is what you need to see in order to be sure that this is the real \"devine\" person.",
    "If the truck wasn't limited, it might win the race. I agree the back lights could be a different scale. Can't wait to see the mods on this thing.",
    "The Cybertruck needs a turret like the m577 APC from aliens.",
    "Why didn't you mention the rusting issues?",
    "The Cybertruck is absolutely one of the worst vehicles the world has ever seen. It is hideous. It can't be sold in the vast majority of the planet because it does not meet safety standards.",
    "This thing is going to have such a high body count by the time it's finally outlawed, if the same witless zeal for consuming that made it possible in the first place ever allows the wheels of government to turn in a manner functional enough to outlaw it.",
    "I was thinking that if they get this anchor here and move it above with a nice easing transition, that would look awesome and I will hit the like button. ... and that",
    "Charging $100,000 for a vehicle, spending almost 5 years on development, and making claims like Elon did removes all allowance for \"early adopter issues\". When you guys had to use duct-tape to fix the door, the car should have been back at the dealer and a check in your pocket to repay it.",
    "I'm so tired of people crying about the CyberTruck online, it's a cool car! I have never met a single person who had a truck that actually used it for anything practical.",
    "I won't buy an EV, but I'd love to try this thing out. It's ugly, but it's different, and that's why I think it's awesome!",
    "He can't hide his Tesla fanboyism, as much as he tries. It's so painfully obivous, so you'd never get a fully honest review about anything Tesla related.",
    "I can tell you in car enthusiast areas, this thing is never the topic of conversation. Also variable steering ratios have been around for awhile.",
    "Since I saw one on the road, you can recognize that POS from a mile away. These things are being rushed so quickly out the door that the glue hasn't even had enough time to dry yet.",
    "This video aged poorly. Literally right before the steering and gas pedal issues came out. lol I guess I'm glad yours don't have those problems.",
    "Tesla is pulling one of Apple's moves here. They don't care if everyone has the same product. The Truck basically screams for a wrap or a",
    "i mean, it sure is iconic... not for the right reasons!",
    "Marques is hands down the best reviewer in the world.",
    "There's gonna be a lot of first time truck owners and outright oopsie girls that have unrealistic expectations about what any truck can do, and get it in embarrassing situations.",
    "Bro you have been payed to do a promotion.",
    "Bikers hate trucks; they are some of the most dangerous vehicles on the road. The cybertruck is most dangerous out of them, especially for bikers who",
    "Just say it sucks and will end up landfill, we prefer the truth and reality, The emperors new clothes was a great story.",
    "I like the Space Balls plug in there lol",
    "What kind of Porsche is this? If you want to compare to a Porsche, use a 911 GT2 RS. These toy versions have no power and are just cheap versions of the real thing that is actually the fastest street legal car one",
    "Everyone still stares when a DeLorean drives by. It's an iconic movie star of a car. Still didn't stop it from being one of the biggest financial disasters in motoring history.",
    "There's a reason most trucks look the same - the design works. The cybertruck has horrible bed space, it's not safe in an accident, and it has issues",
    "I have to be honest. It's one of the ugliest vehicles I've ever seen.",
    " aimed at long distance towing and short range towing are very different.",
    "This video is an excuse for Tesla and a coverup about all the shortcomings of the truck. It is not a review nor is it iconic.",
    "Having no outside door handles, you pull on the edge of the door to open and push on the side to close it. They pushed this truck out unfinished because it was taking too long.",
    "A massive LCD screen in the center console that forces you to take your eyes off the road for every slight adjustment is a disaster and should be illegal.",
    "I think getting it painted would be a good idea because bare metal will rust and corrode, no matter if it's stainless or not.",
    "This shit screams \"brand deal\" The cybertruck chops off people's fingers, is not rust-proof, the glass breaks easily, and is just something a grown child on drugs named Elon drew in 15 seconds on a napkin.",
    "tbh i think the way the gas pedal can get stuck all the way to the floor if the cover slips is the most dangerous thing",
    "In the US you have no norms for pedestrian etc? This will never be seen in the EU. It is a coffin on wheels.",
    "\"No it's not stock\" Oh yea that's your baby for real",
    "...Not adressing the lack of crumple?",
    "What types of lenses and cameras do you use to film? Is there a video on your channel about this already? I would love to hear a breakdown of your process for achieving the \"iconic\" look and feel that is present in your videos.",
    "Dude im typically a pedestrian and this would like kill me",
    "12:46 be real man, very few trucks have the CEO of the company saying unrealistic stuff like you will be able to use it as a boat briefly",
    "I've seen smaller cars collapse brick walls on avenues given enough speed. Imagine what a three metric ton steel brick on wheels would do to plaster and drywall buildings.",
    "It seems like hes trying really, really hard to rationalize liking something that he just really doesnt like.",
    "It's iconic for all the wrong reasons",
    "I think as Elon continues to alienate more and more people with his handling of Twitter, Tesla faces a branding struggle of their own. More people are going to have negative reactions to seeing Tesla vehicles over time, and owning one is increasingly going to be seen as supporting",
    "The most dangerous thing about the truck is indeed its pointy edges, the exact reason why you can't sell it in the EU.",
    "The sequence on the drag race had me like: \"What the heck? We're talking! I'm so excited!\"",
    "The worst thing about this vehicle is that you get associated with Edel, and that's something that doesn't fly in my country. It's like wearing a swastika in",
    "There are many other reviews that show how awful this monstrosity really is. Cheap interior, poor fitting panels and almost instant body rust are just a few.",
    "Have you ever considered why the biker gave you a thumbs down?",
    "left-liberals hate it with a passion, everyone else loves it.",
    "I remember the PT Cruiser, and that car is definitely iconic. Almost everyone wanted one. The Cybertruck though? Nope.",
    "I feel like the PT Cruiser was getting laughed at the day it was born because it looked like what Grandpa thought was cool when he was a kid. This will never be lame like that because it looks futuristic, and it's not hard to",
    "He thinks they're filming like \"Look! A Cybertruck!\" but really they're like \"Look! It's MKBHD!!\"",
    "A buyer crashed his truck after the inputs on the breaks stopped working and the car accelerated into a traffic lane. The airbags did not deploy, but the driver didn't die.",
    "Note to America: he used the Chinese cellphone market landscape to identify a more competitive capitalistic ideal.",
    "I've seen one on the road, it was cool, I like it. Easier to operate if you're in a space suit, and large flat surfaces for solar recharge on the moon. These could be customized to be heavy equipment tools like dozers, excavators, cranes, etc.",
    "i thought the initial renders of it looked cool, but seeing videos of it in person changed my mind.",
    "More like emblematic of idiocy and hatred for value.",
    "The shape and design looks a bit stupid and desperate",
    "Its a big, shiny, futuristic piece of a turd. \n\nA big fail. A shame to any professional engineer.",
    "I use to respect Marques as a reviewer but now he is just a tesla stan. Wont acknowledge the real issues that plauge Tesla.",
    "You view this from the perspective of a tech nerd, not from a driver's perspective. It is good as a conversation starter, but that's it. It's not as strong as it claims to be, and it's not safe at all.",
    "Yeah it's an iconic turd.",
    "It's important to note that the base 911 Carrera t is the Porche variant that is closest in price to the top end CyberTruck.",
    "I love your channel!  Thanks so much for sharing your experiences.  We'll be getting ours sometime next year. ",
    "I need one. My order has been in queue. Patiently waiting.",
    "You seem unfamiliar with who specifically identified with and adopted the PT Cruiser as their icon. Cybertruck is big, dumb, and ugly, but there's some great engineering there that I look forward to seeing wrapped up in a more practical package.",
    "ppl saying bad stuff but I could swear this came out in like 2018 or 2019 or was that just when it was an idea",
    "My daughter drew this. I know you wouldn't believe it, but yes she did.",
    "You have car drivers reviewing a car that will never be a truck. The high sides on the bed and weird angled sides are ridiculous. Ask a person who uses a truck and they will laugh this channel off the air.",
    "This guy must be getting paid. Its cheap parts, back is ugly, and you're at the mercy of another liar who makes simple complicated.",
    "If someone hits you, you'll be fine, but you will be smeared across the windshield. Cars have crumple zones for",
    "Folks just can't realistically look past the fact that buying a Tesla equates to supporting an organization led by a homophobic, anti-semitic, modern day robber baron.",
    "I thought it couldn't be any uglier in person than in pictures, but I was wrong. It is even ugler in person.",
    "Wank Panzer         or         InCel Camino?\n\nJust a pathetic scrapmetal statue to male ego.",
    "@mkbhd when are you visiting China to review Xiaomi SU7 ",
    "19:52 My brain went \"this, This, THIS IS MY PRODUCT! This is MY recipe; it's MINE!\"",
    "Just saw the best name EVER for a cybertruck.... Behold the Wankpanzer.",
    "\"The most iconic profile is the side\" nice one",
    "The cybertruck is a failure of a truck and a piece of tech. Stick to actual tech reviews.",
    "no. its a pile of garbage. won't even give this video a complete view.",
    "Electric Car Company Loses over $500m after Customers Reviews. A YouTuber, Marques Brownlee, reviewed an electric car called Fisker and on his YouTube channel, shared his damning observations of the car. He did this despite the car company asking him to wait for the software update that they said was coming to the vehicle. There are mutterings that the company may go bankrupt.",
    "Iconic? From all the rust I've seen more like ionic.",
    "Its so weird seeing the city I live in and roads I drive on daily in the background of all your shots. Very cool!",
    "Is it just me or is the \"sss\" sounds when Marques speaks is strangely super sharp and loud in this video?",
    "Have you noticed that the attention you crave is gradually being replaced with laughter and derision?",
    "Any collision that would result in a dent on a normal car will dent this. It won't even be worth its weight in scrap 10 years from now. It's not a video game, it's the real world. The inside bits, the actual structure of the car, matters more, and I'll leave that to NCAP tests.",
    "I couldn't just tighten 2 bolts for the latch. I spent more time on duct taping it. Not to mention how",
    "With all the cheap PCs out there, the Mac will always be iconic. It brings a certain pride in ownership that most computers don't. After a while you get used to it, and yet it somehow stays iconic.",
    "This guy has drunk the kool-aid. The cybertrucks designs is not \"iconic\", it is novel.",
    "The cybertruck has deeply concerning flaws, I was hoping for an objective review and this was not that. Im disappointed.",
    "It's a mistake to conflate some missing options like tires and software features when only the first few thousand are being made. This is a choice Tesla is going to impose on all 2mm preorders as if it will stay this way.",
    "keen to see what the narrative will be in 5 years. awesome content",
    "It is without doubt an eye-catcher, but taste is subjective, so whether I feel it looks ugly is irrelevant. The interior is simply boring.",
    "At the time we felt like celebrities driving this unique vehicle in the early 2000s. I wish I had a dash cam to show the amount of attention we received in Chihuahua Mexico.",
    "\"Iconic\"... I guess that's one way you can put it...  an iconic pile of",
    " My favorite reaction is \"Intro timestamp 0:36\"  The facial expressions as the child was putting on jacket.",
    "....Driving efficiency. Which, thanks to the aerodynamics of a  refrigerator, is not great.",
    "He'll justify this piece of extortionist junk but then throw a tantrum about a mean Tweet by DBrand. I guess ethics are totally dependent on whether you get a free car",
    "Modern cars are generally designed to have crumple zones in case of a high impact accident. Something tells me the cyber the truck was not designed with",
    "I think a better example of an iconic mass produced vehicle is an Airstream. Originally built in the 1930s, the design has changed very little. They still turn heads, people stop and comment, and I've never heard of anyone disliking them so much, they give them a",
    "The vehicle is completely \"un\"engineered from being convenient, to trendy. A horrible vehicle design.",
    "@mkbhd where is your mic? It sounds like you are speaking right into a studio mic but I dont see any mic on your body",
    "Someone parked their cyber truck next to a restaurant I was at last weekend, and it took like 10 minutes for someone passing by to write I'm big ",
    "As I immerse myself in storytelling and video creativity, VideoGPT quietly works its magic, transforming my content into captivating pieces of art.",
    "Half the space in the battery compartment is empty. Why?",
    "I am not a hater, but that's a pedestrian killer right there. Also, if you hit another car, nothing will survive while you can drink and",
    "Why does this video have like the most crazy camera work and editing and they are just chilling with it",
    "I drive a Model 3, but I'm really glad that cybertrucks are banned in the EU. For all other road users, an accident involving a cybertruck can quickly become fatal.",
    "I'm positive these will be collectable for a number of reasons, and soon it's a possibility it will stop production. I suggest all cyber truck owners hold on to them; they will be the next generation.",
    "It's hard to say what's the worst thing about them, but EVs are dumber than dirt, and truck EV is even more absurd.",
    "It reminds me more of the Chrysler Prowler or the Saturn Sky when I first saw them. Just an interesting looking vehicle that everyone who saw it assumed it was expensive.",
    "I like the look of the cyber truck, but it's too reflective for road safety. I feel like it'll make a nice camping car.",
    "Not mentioning the lack of crumple zone SPECIFICALLY when talking about the most dangerous part of the Cybertruck is a bad choice",
    "One of my main personal reasons for disliking the car is because the design looks immature and I dont like Elon Musk.",
    "Cars already feel hostile. The cybertruck is American automotive hostility refined to a point, literally.",
    "The Edsel was iconic too. And Ford Prefect was given his name from Douglas Adams on much the same reason American's laugh at the Edsel.",
    "Iconic like Yeezy's... from stupidly overpriced aftermarket value to everyday and even below retail MSRP value.",
    "I must be the only one who looks at it with abject disgust on my face.",
    "I've seen like 3 of these in South Beach. These things are fucking hideous.",
    "My ultimate issue with the Cybertruck is honestly more of an issue with Tesla and this new wave of \"techie\" vehicles overall. All the software and touchscreens replacing perfectly functional features seems to me a hundred more ways a car can break. It's all just a vanity purchase rather than a practical vehicle.",
    "I love this vehicle because it's different. F150s, RAMs, Silverados and Sierras are ugly and dated. Some of the trims on those trucks are cool, but you're going to spend high five figures to",
    "The irony of a black man praising a Tesla vehicle. If you know, you know",
    "I dont blame the people for recording the cybertruck. If I saw a refrigerator that had wheels I would to.",
    "Instead of being honest about Cybertruck, Marques is worried about what Lunatic Musk will say about him or it will jeopardize his future with Tesla reviews. Cyberruck is overhyped, overpriced, under delivered and rushed out the door.",
    "The VW Beetle, Nissan Skyline, and Mercedes SL are some examples of iconic mass produced cars. But the cybertruck will need many more years before there is consensus it's an icon.",
    "I think a vehicle to compare it to when you say \"iconic\" would be the Hummer. I remember when it first came out it was a big deal, but it's calmed down over the years. I think the Cy",
    "i mean, it's so ugly you can't look away",
    "it's ugly asf but i. like it i think",
    "You're saying that 60 Mike Tyson can go toe to toe with a 20-year-old boxer, but he just might not win in the long run. The fact that he's 60",
    "Cybertruck comes to give a boost into the pick up truck market in terms of style, style, and dynamic. With the years to come, the truck will become even better.",
    "I think the Cybertruck is something like a G-Wagon. In theory it could go offroad but no one does it. You buy it because its cool.",
    "Imagine gaslighting yourself into thinking the Cybertruck is a good looking truck. . .",
    "I cant believe you still live in Newark NJ area bro.",
    "It's not good looking lol. Don't kid yourself.",
    "This is a truck that sucks at towing long range and going off road. You'll have to wait a long time to get one after paying. Rather get a Ram TRX.",
    "I will help you out. The cybertruck looks horrible. Maybe spend some time looking at classic cars from different eras to gain some insight as to how shit it really is.",
    "As a pedestrian and bike driver, I would feel even more unsecure next to a large, medium sized SUV.",
    "Waiting for someone to put refrigerator magnets on it!",
    "Didja see the video of someone smash and grabbing a Cybertruck?  Dude couldnt cut thru the glass. Cybertruck is smash/grab proof.",
    "I remember back then we were always stopped by police just for them to ask about the van because it was a shape and because no one had seen it before.",
    "In a few years, these refrigerators are likely to become e-waste after the initial novelty fades and the social media algorithm shifts to the next product.",
    "Beautiful Video- we get ours in a week. How have you been keeping yours clean?  Im OCD with fingerprints!!",
    "This car should be cheaper than prius. Cheaper plastic on bumpers, sheets of aluminium, lack of complexity of stop lights. They are just the cheapest components from the Chinese market.",
    "The best way to clean stainless steel is to use zero water. It's the minerals that make stainless steel look \"fingerprenty\"",
    "Iconic? Sure. Dont think you'll like what it's iconic of.",
    "I've had an F-250, F-350, and I'm looking forward to getting rid of my F-450 for the CT. EVs are not bad at",
    "Iconic looking??? \nIronic looking more like it.",
    "I don't think it's going to take the same path as the PT Cruiser. The difference is that the PT was actually a piece of junk, sharing the same platform as the Neon.",
    "Ive seen 3 of these in the last week did they just sell a bunch of these cause I feel like thats not normal ",
    "I love how all the Cybertruck reviews dance around the fact that it sucks at being a \"truck\" doing actual truck things.",
    "The comparison here with Tesla as iconic and pt cruiser as ugly is a little stupid.",
    "I love this video, it's really high quality, good points and feels complete in a way. Yes, they choose to race it against the \"weakest\" Porsche, but it's the most similar for price to go against, so it doesn't feel unfair.",
    "It looks like an Aliexpress novelty PC case made from recycled scrap metal. I would bet it will eventually end up in a Chinese metal and electronics recycling facility. The Cybertruck body is made from 300 grade stainless, which will definitely rust when driven in the rust belt during the winter, especially if taken on salted highways in the winter.",
    "This is one of the best videos you have ever done dude. Wonderfully executed",
    "As with all Teslas, the powertrain and battery are top of the line, but the cabin and exterior are Fisher-Price potato chip quality garbage. It's Tesla's first version of a vehicle that will eventually go out of style.",
    "17:08 my child got memust be nice my guy, hopefully Ill have a child like that one day! ",
    "I think we need more tech like the cybertruck, or even ideas like it. Dare to do things radically different come what may.",
    "I hope that if this thing comes to the EU, it won't start a truck culture here. We don't have any trucks at the moment, and that's a good thing, but I don't want the cybertruck to",
    "am i the only one who notice that someone writes \"CT1\" on the window????",
    "It was a similar feeling when the 3/Y were released. You saw one and you thought it was the new Tesla, but now you might see it and think \"it's a Tesla\" but it's less of a wow and more of a",
    "Great review super well put together, your team and you constantly keep striving for bette, here for it!",
    "Iconic is such an overused term these days, half of Huckberrys inventory is iconic.",
    "Are you kidding me?! Tesla creates a truck that accelerates faster than most half a million dollar super cars built for racing and you're calling the performance of this thing overrated? Id hate to be in a relationship with you",
    "Why I feel I have watched this video like long time ago already",
    "Electric motors don't need gears because of their low torque curve. ICE needs gears to \"get out of the hole\"",
    "The percentage of commercial and industrial trucks used for hauling has to be near 100%. Try to find one without a hitch. The yard guys all over the place are pulling their mower trailers.",
    "Headlights are problematic in snow because the snow packs over them and they're not heated. You have to get out and clean them off periodically.",
    "Stainless steel is not only overrated, it's undesirable because of its weight. I expect in the future the stainless will be abandoned, and the styling changes aluminum will offer will be leveraged.",
    "5:40 At high speeds the steering actually \"crabs\" when changing lanes. The back wheels and front wheels turn the same amount in the same direction.",
    "The most dangeroues thing is that you were paid to make this video u shill ",
    "Let's see how long it takes for the kids to get bored with this one.",
    "Ok now i think the social problem you mentioned it happening because a celeb youtuber is inside the car lol",
    "He didn't mention a single negative without trying to sound it as a positive. He didn't even review the truck apart from hand picking a few positives and white washing the negatives he said last time.",
    "Driving a Porsche on a drag strip is such an American thing to do. Porsche belongs to a proper race track with turns, and the Nordschleife is it's home ground.",
    "Actually REE has been producing the steer by wire truck chasis for a while. But is going for a different market.",
    "I think it is stupid because the stainless steel is going to mark and rust, and the tray is too small to be useful.",
    "Thanks for the great insights @mkbhd it was well informative and you are truly the best Point, Blank, Period! ",
    "Tesla has convinced the world that no design is the best and coolest design. It's easier for production and cost purposes.",
    "I'm disappointed. I've lost so much trust in the company, and this video is the perfect example of why. It feels disconnected, and soft on serious life-threatening issues that plague this car. What other issues have you glossed over, minimized, or covered up in your other videos",
    "OK, that opening, graphic, sequences, boss!",
    "I saw a red cybertruck on the highway, and yeah, it was a site to see.",
    "At 23:40, it's like you are sitting between two pieces of furniture.",
    "Can you make a video on the Zune 30GB?",
    "If you liked the rear view of the Pontiac Aztek, you'll love the rear view of the Cybertruck.",
    "When he said dont go getting any ideas its invincible I halfway expected the title card to pop up.\nIykyk",
    "I was wondering about the DAC and AMP quality that is built in to this truck. What's the speakers type and quality and resistance in ohms? And is it a surround",
    "Love your videos, keeping it real!",
    "@6:39  I was ready for him to pull a 9mm out",
    "Hey I've always wondered if Best Buy's open box items are worth it or reliable. What are your thoughts on them?",
    "While I dont like the cybertruck, however I think you did a fair job with this video. ",
    "Franz Von Holzhausen once again proves he's a terrible designer. None of his vehicles look exceptional for the price. He's basically a Mazda guy who lucked out and got in early with Tesla.",
    "I'm not a Tesla fan because I don't like the design of any of their cars. However, I do think the designers of this hulking piece of metal have been very lazy. It's like they've just binge-watched hours of Robocop-type shows and come up with this.",
    "That truck is utter trash the design is so horrible on original just something out a 1984 sci-fi movie. Its brand new and already looks outdated ",
    "i can listen you all day Marquees\n\ngreat video as always",
    "I don't know about you guys in the US, but here in Europe this thing won't even be sold because of safety regulations, especially for pedestrians. Most cities are too narrow for trucks. Is that a concern for you?",
    "i think the reason people think it's more expensive is because it looks like a dumb modern art project, and dumb modern art projects are overly expensive",
    "A lot of people are making pictures of it, just like they would gather at an accident to gawk at the carnage. This car is a midlife crisis mobile for people who are desperate for attention.",
    "Whoever did that intro graphic, you KILLED it",
    "This video is ICONIC. Fire man, as always.",
    "I'm waiting to see what you want to say about iphone se4 and pixel 8a ",
    "Well, Air Jordans are still inconic and everyone wears them. I dont think the rarity will matter. This is a revolutionary design.",
    "This is an unexpectedly positive review with very few mentions of any criticisms other reviews have been levitating at the car. It's a very well produced video, but it doesn't really feel like a review at all.",
    "People who don't like your truck are less likely to go up to you and tell you. Kyle from Out of Spec tried to make the same point as you, but his girlfriend broke in and told him how often she heard people complaining about the truck because they didn't know she was with Kyle",
    "Iconic??? The Lo-Res car, and the process that led to it, was/is iconic! The Lo-Res pickup truck is just an embarrassing imitation!!",
    "Hay Marques, can you make an in-depth review of the new Xiaomi 14. Think it's a killer phone for the price !",
    "The only reason the steel is \"safe\" is because it weighs 3 tons. If it gets hit by another 3 ton vehicle, whoever is inside is going to get rocked.",
    "This is the third video on this, and you're trying so hard to mitigate how much of a shit show this car is. You're not being paid",
    "Just as well it's not coming to the UK - people wouldn't be able to stop laughing. Not good when we're supposed to be concentrating on all those pot holes we're",
    "Lmao, this review is a joke. Then again, what to expect from this guy?",
    "Really thought for a second that he is going to pull out a Gun 6:45",
    "Yeah, but Countach is beautiful; Cybertruck and  Veryron are weird looking.",
    "The car is a junkheap pushed by a man with the mentality of a 10-year-old and a very bad drug habit. It rusts like mad and is very poorly designed. It is NOT iconic.",
    "It's the face mask of the iron man. It is a crap car.",
    "Tesla understands social media marketing. They could have made a completely fair, honest, reasonable video about how quick the cybertruck is, and it would have gotten no attention. Instead, they made a video that was intentionally misleading but still impressive, and now it's being replayed to massive audiences all over social",
    "This is not a review. This is an ad. How is visibility? Range? How long is the tray? You didn't mention a single negative without trying to spin",
    "According to Rivian and Ford, both the RT1 and Lightening can tow. I didn't check the Hummer or Wrangler, but would be surprised if they had any towing capacity.",
    "I think I was just tricked into watching a twenty-eight minute long Cybertruck commercial. \nI feel cybercukt.",
    "This is the best MKBHD video I've ever seen. Forget the fact that its about the cyber truck. I'm talking about the writing, cinematography, the editing, and those transitions.",
    "Im not hating, but you can see where this truck is sort of like the back to the future car and a few other sci-fi trucks from the 80s",
    "I always notice Teslas on the road because they're not common, and they're unlikely to ever be unless you live in LA.",
    "I feel your description of iconic is the same as what we saw with the Range Rover Evoque. Looked insane and then more and more",
    "If someone hits you, youll be fine. Im not so sure of that. I worry about lack of crumple zones",
    "There are many cars that look modern without looking like a childish fever scream.",
    "The PT cruiser was absolutely beautiful. I wanted my mom to buy one so bad just so she could have one and I can drive around in one. It was just so much different than anything else.",
    "people are going to talk to you because you're marques brownlee. you're a rock star.",
    "If you are a fan of old models, the beautiful Cybertruck design will most likely cause you rejection. People who love new experiences and enjoy modern designs find it beautiful.",
    "These shots (of the truck, while driving) look like the highest end rendering I've ever seen. It's literally crazy, better than any high end",
    "Can we give the animators a round applause!? stellar work here!",
    "A truck that is literally like a giant geometry square. The sharp edges of the headlights were banned because of their sharp edges.",
    "Hey i need surgery if you willing to help reply or at least thoughfully pray for me ",
    "Love your reviews.  I've never owned a tesla, have always had trucks and Jeeps.  This is iconic. It feels like a swiss army knife.",
    "Those people pointing , they were just pointing out all the fingerprints",
    "A very ugly product!!!",
    "This same panel gap issue was on my Ford Mustang Mach-E passenger side. Same cause as well, loose door latch on the frame, not torqued completely. Sounds like its not Tesla specific but something that can just happen in the manufacturing of",
    "It looks like crap. There is nothing iconic about it.",
    "They forgot that a truck is meant to carry stuff. Not a working tool, just another fad from the raging X man",
    "I don't know how you can put this overpriced unused asset in the same breath as actual iconic vehicles. Way too much slobbering on Elon's stick shift here and",
    "It will never get the cruiser effect. It will become one of the new shapes every one knows. 80% love it, 20% hate it, and the ratio shifts in time either way.",
    "how much was to shill for this??",
    "oh its going to be iconic....for allllll the wrong reasons. lol",
    "The screen is too small, the interior is ugly, the build quality is not enough, and the CEO is a terrible human. I can't get behind the idea of getting a Tesla, especially with him involved.",
    "There are many reviews of how cheaply made this thing is and how they lied about the tent that comes with it and how bad quality it is.",
    "As the owner of two Model Xs, I'm very happy with them, but I don't plan to buy one. There are too many production flaws and the rust and fingerprints would drive me nuts. I hope Tesla sells millions of them but for me, no thanks.",
    "80:20 joy-disgust ratio? Highly doubt it. The majority of those 80% most likely think that the cybertruck driver is a clown. There are so many people who know nothing about the car and might seem excited. What would happen if you would actually tell them what kind of piece of garbage the car is and how dangerous it is?",
    "Everyone forgets that Elon just stole Tesla from two other guys who made the company. And then he makes a nightmare truck that will hurt everyone else in an",
    "Duh of course people are going to stare at something new or different.",
    "That German person is so lucky to have traded jerseys with Marques! ",
    "Super Informative and balanced Marques, I only stumbled across your channel a few months ago it is clear why you are so popular, huge respect and thanks",
    "From a boy to a man, Marques came from long way, the quality of this video is stunning !!",
    "Hey Marques, please consider doing video on xiaomi 14, presently its the best compact phone in market",
    "Phenomenal video Marques!!!!",
    "This pickup car is faster than many other sports cars, but it is slower on long distances, so it is overrated. What is wrong with you?",
    "I like the good and classic Chevy trucks built to outperform and outlast. I intend to buy a truck and install a 4L80E transmission for the same reason.",
    "I have seen the Xiaomi one and this ugly thing on the same day",
    "Hey just wanted to say that this is, objectively and subjectively, a top tier video. Really enjoyed how thorough you were on this one",
    "When you cut out all curves, what shape do you have left:@&*%",
    "Not talking about the safety of these disgusting kill machines is absolute ignorance. This is a detriment to pedestrains and is sure to trailblaze an upsetting trend of huge fast kill machines.",
    "8:38 My Model Y had the exact same issue. Tesla mechanic came and fixed it.",
    "The Cybertruck is also not crash tested. Somehow they managed to arrange it so that Tesla gets to decide for themselves whether its safe or not.",
    "I cannot get past the potential dangerousness of it to enjoy it otherwise. The angles on this thing are dangerous to peds, cyclists, and smaller vehicles. The trend amongst makers of mid/large SUV's and trucks to have blunted (vs sloping front ends) making them appear more like large tractor trailer trucks is ridiculous.",
    "I saw one at the homedepot yesterday. It looked like a stainless stick oven  They could've coated with gold to make it look cooler",
    "The VW bug, the Ford Mustang, Ford F150, Chevy Corvette, the US Army Jeep, and the Chevy Corvette are",
    "It is so flat perfect for gluing solar panels on the surface",
    "I would not give a damn if I saw one of these ugly things on the road. It's a vehicle, step out the Matrix for a sec.",
    "I dont like being beta. I like being alpha.",
    "So obvious hes got stock in the is. Shameless",
    "title is alread iconic and they are breaking at 5 miles lol",
    "Having that gap would be no surprise if he only knew how production worked at Tesla. Having worked for Tesla, I've seen far worse than that. It's just another Elon marketing tool to keep interest up in the company.",
    "The 2014 and 2015 Stingrays did the same thing before production picked up.",
    "You say yaw when what you mean is pitch. Yaw is rotation around the vertical axis, and pitch is rotation on the lateral axis.",
    "The New Beetle from the early 2000's had a similar effect as the PT Cruiser around the same time. The New Beetle was round, but it was geometric. It was upright and tall for a small car, headroom like this was unheard of in a compact.",
    "This is what happens when you give an overhyped electric car to a techtuber who knows nothing about actual cars. Please stick to phones",
    "Great video, thank you sir.",
    "It's iconic because it looks like no other car ever mass produced, which means it's eye catching. The amount of videos showing its arguably terrible build quality speaks for itself on if it's a good vehicle and worth its price.",
    "I love your videos not just for the content, but for the research and thought that you put into each one of them! I am extremely impressed by your ability to communicate and the way that you present your content.",
    "The front of the car isn't good at all. There's a reason cars aren't shaped like battering rams unless",
    "I want the most practical truck for my construction business. I don't give a damn about how it looks. I punctured a gas tank on a F150 on a rough site; the replacement cost was about $1,935. To replace the Tesla battery back itself with all modules in it would be around $16,000. A windshield for a Ford F150 will cost about $700, while the Cybertruck retails for $1.900.",
    "I like his reviews on most things, but I'm sick of him being such a shill and fanboy for Tesla and Elon Musk. He points out some very serious issues in the first video and then still says he would rather be in the cyber truck.",
    "The people who buy Teslas don't have money but think they make them appear wealthy. It's a status symbol for pretentious",
    "Felt closer to a marketing video instead of a review",
    "When the Beetle was re-leased as the new Beetle, at first we got so many people stopping to stare at us and wave to us, it was hilarious, but over time it wore off. And I can say the same for the Mini Cooper. Both are older vehicles that have been re-envisioned and yet they were iconic and people were excited to see them.",
    "I reached for my keyboard to comment about my experience owning a first year PT Cruiser and at that moment, you made the comparison. My PT ended up being a lemon and it was bought back. I replaced it with a Grand Cherokee.",
    "The most dangerous thing is the lack of crumple zone. But MKBHD is way too friendly to Elon to point that out.",
    "When the production value and planning is so good - that you cannot stop watching the video on repeat. ",
    "Yes, it's ugly af.",
    "It's so dangerous it's banned in EU...",
    "I live and Germany, and I'm VERY happy I'm never going to see it here",
    "I would say it is famous more than iconic. Most people getting it are in the \"look at me camp\" It is impractical and roundabout paths had to be made to work around the horrible design.",
    "Cybertruck will become a meme in the future, for being a horrible ugly failure.",
    "yes it is iconic. its also shit",
    "The PT got a lot of buzz and lines at the Chicago Auto Show, but really it's meh. I thought it was cool, but then it came out and I was thinking the Rivian looked better.",
    "Its a electric El Camino. Nothing new to see here. This has already been done. Its not a truck ",
    "Cyberstuck",
    "It is a slightly better design than the Sinclair C5. It is a vanity project for people with an excess of funds.",
    "Short cute chicks with daddy's money who don't know how to drive and can barely  reach the pedals are the main customers of trucks in Russia.",
    "When people do it it's called peacocking. Does not mean it's iconic",
    "A raving junkie in the corner of the train compartment will get the same reaction. Don't let words like 'iconic' erase that.",
    "This car makes no sense from a practical or aesthetic purpose for me as a consumer now that I know a lot about it. I put down a deposit way back when it was first announced. I'm also one of the millions of consumers who no longer wants to give Musk their money.",
    "i am really surprised by such a low views on this video even after 4 days, especially for an mkbhd video.",
    "Its still hideous... people who have never seen are just shocked at how dumb it looks",
    "This is one of the most high quality videos Ive ever seen",
    "Marques, what dirt does Elon have on you, mate? \n\nBlink twice if he is listening right now. . .",
    "I understand why access is important, but I'm still disappointed there was not a bigger mention of all of the other reasons someone would give you a thumbs down besides car ugly. Driver safety, safety for other drivers on the road, escapability, material durability, service experience are things most people buying a car would want to know.",
    "Awesome video! Keep up the great work!",
    "Cant wait for tesla to make it in green , remove the doors and strap a machine gun at the back. \n\nThen Master chief would be proud lol",
    "I feel like with his look and the pause, he should have said 'iconic' when he said that phrase. He should have meant",
    "I don't know anyone that moves or works construction or does gardening or shopping. I rarely tow but always have had a truck for the utility of having the bed available",
    "For next 1.April please make a review of a paper notebook with basicly endless battery life and \"it literally feels like paper\". And you can scan the paper to get it into the cloud! I would",
    "Dude, you're literally a CT's salesperson 2mins into the video. It's a cringe.",
    "ugly car from a company notorious for poor manufacturing and quality control, fronted by one of the worst people in the world.",
    "no, it's not stock...",
    "I like it when every car looks the same; I love the difference. The thing that puts me off about having a fancy car is people rubbernecking you. I prefer",
    "This isn't a review. It's a glorified ad. It mentions almost none of the myriad of critical issues in detail, just cramps a few of them in the summary in the end. It is extremely unsafe, it's poor quality, and most importantly it's an idiotic vehicle that",
    "The mismatched finish from front to rear door, like the brushed finish running in different directions, is different. It reflects light completely different, and one seen, cannot",
    "Only a matter of time until the Police start driving the Cybertruck to patrol the city streets. ",
    "eagerly waiting for a too much cinematic review from Brandon!",
    "It's a catastrophically abhorrently bad design from a technical perspective and should never be allowed on the streets. It will never make",
    "Testing 123",
    "In my eyes, Tesal in my eyes are over raided. I don't have the range to match any pickup on the road. I will take my 2011 F150 on the roads to you. Then we will drive our own trucks on the same roads back to my home city.",
    "This video is spot on. Really well done.",
    "If your battery dies while driving, not only will you have no throttle, but you won't have any steering either. Instead of being able to pull off the road, you will crash because there is no way to control the vehicle.",
    "Musk is a unstable fool. Until millions are delivered its all speculation that can go under",
    "I'd  be more excited to see Marques behind the wheel",
    "Full-size trucks have a smooth ride, quiet, and plenty of room for everyone to be comfortable. They're also extremely heavily built and thus pretty safe for those traveling within. They've come a long way in terms of design and environmental creature comforts. You don't have to need to haul or tow something in order to justify owning a truck that can do those things. The Tesla Model X has been gliding silently through my dreams for years now, and I would dearly love to have one.",
    "Lack of mention of security is concerning, especially about pedestrian safety. It is the best MKBHD video, but it is not the best video far from it.",
    "What an awesome honest review still love the cyber truck but I have a much more realistic idea of its capabilities.",
    "\"it's not the lack of crumple zones.. oh wait yeah that is pretty dangerous actually.\"",
    "What an AWESOME review, marquees!! Really different and insightful",
    "If it's not available in the USA, please go to China.",
    "NO. It's NOT going to be equivalent to a \"PT Cruiser\" in the future! How dare you, Brownlee",
    "Have you seen the recent Chinese EV cars? Those are beautiful cars. US is going crazy because ... it can do anything it wants.",
    "I can't imagine being a refrigerator designer and being insulted this way on the regular. So harsh.",
    "My biggest issue with the cyber truck is the choice to prioritize a gimmick over efficiency. I hope this is a one off with tesla.",
    "Most people will look because they cant believe people are that stupid. Its not good, and history will judge it that way",
    "In 8th grade, we made rocket cars using wooden or so blocks and even had a competition. The classroom had a lot of aircraft simulator",
    "25:30 so they are all going to come in the same color (steel) when mass produced?",
    "I just need to say the production value of this video is absolutely next level!! You and the team do such an incredible job from creating such fun and engaging graphics to beautiful shots that are so simple but so well done! The intentionality of it all does not go unnoticed and it's so fun to watch you continue to push the boundaries.",
    "I was surpised and also disappointed that the word \"security\" was never seriously mentioned. This review felt rather incomplete on more than one end.",
    "I can see how some people might like this, but to me it just looks like something from a Sega Saturn racing game.",
    "I love the fact that you did not say iterate. You just talk like a normal person.\n I mean that in total sincerity, the Highlander.",
    "I can see why you're doing so well as a podcaster. The Highlander PS Kindness. always free.",
    "Thanks Marques. Great review again. Cool and correct. Thanks for making and sharing.",
    "I don't know, MKB. I'm glad you noted the panel gap you found in the other video, but this seems a little \"fluffy\". Please tell me El'n didn't have a",
    "rocking a German jersey while talking in front of a board, I like it\nGreetings from Berlin",
    "I'd buy any 911 any day of the week. The drive by wire is underrated, but the truck overall is way too over rated and doesn't seem very safe.",
    "its like someone saw the delorean and wanted to make it not cool looking",
    "The most dangerous thing, is the gushing Fanboys.",
    "Like the cybertruck, the Hummer H1 was too big to be practical. Try parking it in a public lot between two cars. Impossible.",
    "Just because people won't use it for its truck capabilities, doesn't excuse it for not performing like a truck should.",
    "Only \"iconic\" thing about this pile of rust is that you can't buy it in the EU, or even drive it. No EU safety standards, driver have to be C class drivers, and it costs an insane amount of money.",
    "I can't think of any iconic smart phone and this thing is like it. It will become obsolete, lost value and age like dog shit much too fast. There is nothing iconic about any Tesla car.",
    "I want to imagine that the hand clapping sound at 17:25 genuinely perturbed Marques and he's going to try to solve it in future videos.",
    "I feel like Jason Cammisa might disagree with you about a car needing to be rare to be iconic. But then I'm not Jason Cammisa.",
    "As with most internet things, passionate hate are merely a vocal minority. I've loved the design from day one. My mom hates it, and neither of",
    "No, they are looking at   Y O U   !!!!",
    "All other points aside, the notion that a hard exterior steel shell will keep you safe in the event of an accident is simply not true. modern cars are designed the way they are now to keep people safe at all costs.",
    "The only noteworthy feature of this electric truck is its sheer power and speed. The fascination with such an oddly shaped truck just baffles me.",
    "I got an idea! Why don't we get rid of all the buttons and the screen, and let the car be controlled on your phone with an app",
    "The intro, the realisation, the quality all the highest level, but the soundtrack selection is lifting it up to one of the best tech or auto reviews in XXI.",
    "I wish my X had that steer-by-wire system. The yoke looks much more useful with it. Most trucks in my neighborhood are very seldom driven off road.",
    "No offense but this video sounds exactly like an advertisement. Your last video was a true review.",
    "Once it was noteworthy, but not for long. Even the VW van was \"iconic\" When it becomes common, it's no longer 'special'",
    "I personally think it's a Pos, and would not even look at it if it pulled up beside me. The muskateers aren't going to save the",
    "When you have too much money, you stop thinking about what people actually want from your product. This is what happened to Elon",
    "How can a slowdown in production make the excess in production and lack of sales better?",
    "I can imagine as a biker that the cyber truck is pretty terrifying. Despite Tesla being all about safety, I nevertheless expect crashes to be absolutely horrifying. Not for the driver",
    "Another Cybertruck video? Brought to you by Elon Musk?",
    "I think it would be better if it was smaller, like the size of the ford maverick. That would help with the safety concerns of injurying others.",
    "I find it strange how many people are so quick to hate Dare to Be Different. It's futurist, why hate that? They look cool in person.",
    "it's backed by the most divorced dad of all time  i could never",
    "Tesla chose this configuration because they had to save weight and keep within a reasonable turning circle. My car has adaptive steering and all wheel steering, which results in a turning circle of a VW Golf.",
    "I didn't watch many videos on the Cybertruck, and only because you did one did I watch the whole thing. I think this was",
    "You are playing for a German Frisbee Team?",
    "The trailer carrying the 911 is speed limited by its tires. It reaches its max speed by the 1/8 mile mark. It doesn't matter how quick a car is if you make the course long enough where speed will win out.",
    "It's different for the sake of being different. It's a step back to the \"prehistoric\" ages of car building.",
    "Why are people acting like the truck is so heavy? Gas trucks can weigh up to 7-9K lbs. They don't even have a",
    "John 3:16 For God so loved the world that he gave his only Son, so that everyone who believes in him might not",
    "Nissan was first to do steer by wire. Their backup was a floating steering column which locked into place upon failure of the electronics.",
    "Gees oh man, that Intro. Sick!",
    "I love the esthetic. My issue with it id for different things",
    "I do think its trajectory is similar to the PT Cruiser. At the moment of mass production, it will become pretty irrelevant.",
    "If I am a rich oil boss, I would pay people to come to famous channels like this and talk crap about the car.",
    "I believe that lexus created the steer by wire first. Unless that electric car they had been working on isn't out yet.",
    "Big ego mobile. Just do some therapy, its going to be cheaper",
    "All benefits of driving electric are lost, only to stroke your ego. It's a dangerous tank that destroys everything in an accident just to keep yourself safe. It is a waste of parking space in any city.",
    "I remember when the Tesla S first came out. It was considered luxury, high class, and rare at first. Now living in OC, Teslas are more seen than any other car. The \"Iconic\" view of it is washed away by the common-ness of it.",
    "I am a medical student in India and need a tablet (any note taking and processing device) can you please help me? You do a lot of giveaways, I hope you'll consider it. Please reply",
    "The most insane thing I have ever heard of is that the door latch is held on with a tape. Who did the quality control for this - Boeing?",
    "There is no way I am buying a second-hand vehicle with steer by wire. I've had many S-Class Mercedes and the electronics are a nightmare of a 150k Mercedes after five years.",
    "I know everyone hates the looks but Ive wanted one of these since it got revealed. It's so different",
    "I was not ready for the sledgehammer to come out lol ",
    "Holy. The production quality of this video is insane - felt like the top gear of tech videos",
    "\"I'm getting dump truck vibes from back here\" is a sentence I wish I heard more often ",
    "This is a dangerous minimalist abomination of a vehicle with touch everywhere. What happens when eventual bugs keep crawling in the system? I am biased and say I hate it. But the amount of Tesla diding Marques does is on another level.",
    "Yeah, American vehicle designs are not known for their beauty, quality or safety.",
    "I've never seen one of your videos prior to this and the Pixel Fold video. Your videos are so well thought out and you're so pleasant to listen to. It's refreshing to see a person so young with qualities that make intelligent humans.",
    "As a kid, I put iconic cars on the wall of my bedroom as motivation. If I saw a kid nowadays with a series of Cybertruck posters all over his wall, I'd think we had lowered the bar.",
    "The Starting Animation & Sound is way more Cooler then Entire Video.... Love it",
    "I'm surprised you didn't say anything about the potential for rust in the stainless steel body. It's not a car for Australia, or anyone living within 2km of the ocean.",
    "A car crash with a cyclist will most likely kill the cyclist. The Countach looks amazing, but it drives horribly. The Veyron has at least 900 produced, and probably a few more.",
    "cmmon, as a German I just have to say it: its engineering trash",
    "Are you planning on taking it on some off road driving? I've seen people complaining about the cyber truck performance bugs there. It'd be nice to see a more reliable review on that",
    "We all know what the most important feature of the CyberStuck is. Its ability to break down anywhere without warning because it's badly designed.",
    "Absolutely love the video, team.  Informative, great videowork and editing and it feels like an honest look. Great work.",
    "Five guys is super expensive and yet they still have a spot to ask for tips for their employees. Why doesn't five guys pay a fair wage",
    "Georgia Tech used that and 4 Mac minis to win 3rd in the DARPA urban challenge.",
    "I saw my first one today in person in Tucson, Arizona. It's much bigger and longer than the videos make it look. I can't believe someone would buy one of these.",
    "Ive seen it a bit in L.A. its terrible looking and the paint is hideous.",
    "In their reviews, buyers were trying to assess how good the car was at doing car stuff; cornering, comfort, fun. To say that it doesn't matter that this truck is bad at truck stuff; towing, range, offroading, because most customers never do that stuff is a bit silly.",
    "an iconic rust bucket, a gigantic failure, designed by a man-child.",
    "So far I haven't seen a Cybertruck on the Street yet..!!! Autoshow Yes! But Not OUT on the Street...",
    "Bunch of Karens in the comment section. Its new, of a design, to technical and to high tech for the close minded brain",
    "26:23 pt cruisers were so cool when they came out. Then they just because bland and went away. I remember them well.",
    "Those wheel covers will most likely cause the brakes to overheat and fail. Trucks too heavy and the breaks are going to get worked.",
    "You can be iconic without being rare. take the mini cooper or the Fiat 500.\n\nPS great video, keep up the good work!",
    "Not good looking, but is unique...",
    "LOL, \"no arirplay of android auto\" such a funny review",
    "There are so many cars with curved chrome pieces on the back that blind me. Why is it necessary for designers to put a mirror on the car that is curved so that it can reflect the sun into your eyes from any",
    "In the 70s and 80s, a major criticism of North American cars was the over focus on style, while ignoring how a vehicle did its job. The Cybertruck is the equivalent of a 1976 Cadillac convertible with horns on the hood. It's all about style, with no attention paid to functionality, and it's a joke.",
    "I have to believe the cybertruck eats tires. It needs to be changed 20% more often and costs 50% more.",
    "I love everything about how this video was shot and edited, but does anyone feel like there was an almost uncomfortable amount of blur around the edges of some shots? There were a few shots, particularly scenes of Marques speaking directly to the camera, where I almost felt like squinting because it didn",
    "Even if Tesla used the cheapest 911, the Porsche is still at least $25,000 more than the CyberBeast.",
    "It's not fine that people are using this as a glorified SUV. Massive cars like this are so dangerous. They ruin our cities, take up way too much space for a single person, and are extremely dangerous.",
    "They're behaving this way because they think this guy is Usher, and the Puff Daddy scandals aren't helping.",
    "You know what's iconic. Mile is",
    "Man I just want to get places safely that's all. Who cares what you drive. I look down on people who buy this stupid truck.",
    "There is no God but Allah, and Muhammad is the last messenger of Allah. Just read the Quran for once, a learned personality like you will know what's the truth.",
    "if i controlled rewind, i would want fortnite and marques brownlee",
    "The worst part of the looks of the Tesla Cybertruck is that if any other car manufacturer makes a similar vehicle now, everyone will cry that they are a copycat",
    "If they ever make it back to the future remake, this should be the vehicle they use. Plus the stainless steel would help with the flux dispersion.",
    "It's the first vehicle on the road made with an exoskeleton, which is why its bulletproof. It's iconic because it doesn't look like every other pick up truck out there.",
    "You shouldn't be able to see the side of your car in your mirrors; they should be adjusted to see your blind spot.",
    "do you feel bad at all for killing Fisker and costing the investors millions of dollars?",
    "For being so blunt with the Fiskar, it's interesting how lenient he was about Tesla's clever advertising. What about the clever little hundreds of miles of range missing? How about the safety ratings? Is he just embarrassed because he already bought the top of the line model?",
    "The acceleration and hard, angular exterior is going to be disastrous for accidents. The agility too. People are going to drive it like a sports car and get into accidents. If that's with a pedestrian or small car, the cybertruck will just cut right through them.",
    "How did this car ever pass safety rules? If you get hit, you're dead, and the car is useless. A pickup truck",
    "I saw one driving on the Northway the other day that would be 87 New York. The license plate was from New Jersey; it might have been going to the Adirondacks. The sound it made was really loud; it reminded me either of a Battlestar Galactica Cylon or what I imagine a UFO would sound like.",
    "Infiniti was the first to steer by wire and everyone hated it.  Because its a Tesla everyone loves it.",
    "The most dangerous part is the flat front of the car. The reason these cars have a pointy front and not a wall is because it reduces fatalities when head on collisions happen. Its like if a brick wall is shot at you by a big cannon.",
    "So basically it's a piece of \"bleep\" by the fantasist Musk.",
    "Only 7% of F-150 owners use their truck for towing, but there is no other option. You can't rent a truck unless you sign an agreement that you won't tow anything. The Cybertruck that rides like a nice car is cheaper on fuel than any ICE, roomier than most vehicles, and will eventually be reasonably priced.",
    "The most dangerous thing about it is how you can slice your fingers on the frunk",
    "Iconic like the Hummer i would say.",
    "This truck will one day probably kill me in a car accident driven by a drunk driver and I don't feel safe sharing the road with it.",
    "Iconic cuz it sucks and is so unnecessarily stupid looking. Also the functions stink",
    "Great takes. Its so nice to see someone unbiased and putting in their due diligence to provide quality info.",
    "I wouldn't want that standing still on the road I bike, let alone driving. The guy on the bicycle probably saw his impeding death",
    "If it's a refrigerator on wheels then put the refrigerator magnets on it. I want to see those ABCs and 123s all over",
    "The design is unique but I don't predict it will age well. It will be forever planted in 2024 and will define this decade of car design.",
    "13:25 millions? Then they will have to become a lot cheaper! (And more practical)",
    "In the past week, I've seen about 15 Cybertrucks driving between the Fremont plant and La Mirada in LA. It's rare and a neck turner.",
    "Perfect two words. Visually interesting. I personally love it.",
    ": Fingerprints?!\n\n: Slap in a Dbrand skin on it ",
    "Towing is not the only thing you want a truck for... hauling gear in the bed is something you use on a much more regular basis.",
    "I don't think you're a reliable tech reviewer anymore, and I'll tell you why. You ripped apart Fisker Ocean for simply stupid reasons that can be easily fixed with a software update. As far as the Cybertruck goes, maybe it's time to stop the mass delusion and admit that it is a tin can on wheels.",
    "My girlfriend hadn't heard about the Cybertruck. She saw one next to her at a traffic light and sent me a picture with a message: \"Are we at war? Why is there a futuristic looking tank next to me?\" I died laughing.",
    "100k with 250 mile range, horrific build quality, and looking like a special ed kid drew it in crayon is bad enough, but the interior is like a work truck trim level ffs. You don't even have dash guages just a shitty little tv bolted onto the center. Its complete trash.",
    "You can tell a lot of work went into making this video.  great work",
    "This is a bad truck.  Avoid.  It's a shameful that it's allowed on public roads, along with the usual underused suv's and trucks",
    "I think the kind of person who buys a Rivian EV truck is very different from a person who bought a Cybertruck. I was excited to see Rivians in the wild three years ago and took pictures of them and talked to the owners. Now I see them regularly and they are just another part of the street scape.",
    "It's not feet, it's meters.",
    "I love the PT Cruiser reference! I wanted one so bad! I loved the que ball shifter on the manuals! I have my reservation for the cybertruck and am willing to wait for it to become available. Hopefully my Tesla M3P will be paid off by then, LOL!",
    "I think the Cybertruck will become a new norm and force manufacturers to reimagine what a pickup is.",
    "I believe they're not \"stamping\" the stainless steel, as you said multiple times. They're just bending it. You can't just stamp the sheet metal into any shape because it's too strong. Only bend straight edges, then glue or weld the pieces to the body.",
    "I saw a cyber truck on Easter at church, and two old people immediately waved and took pictures of it. First time Ive seen one, pretty cool",
    "Iphone 1 was mass produced, but it is still iconic",
    "The only good thing about this monstrosity is knowing that its banned in Europe and I never have to encounter one in my life.",
    "That truck is hideous in person. I've seen 4 so far and they all look dirty regardless. It looks like a doorstop with wheels.",
    "Weird discoloration along the door lines. This thing is so stupid.",
    "There are a lot of people disliking Elon Musk because of all the sensationalized and fake news around him for being part of a cultural war. There are way more people complaining about other's opinions because everyone needs their own views being validated with comments agreeing with them.",
    "How is this allowed on the streets? aren't cars made to fold in and collapse on themselves to help absorb impact in accidents? If you get hit by a Cybertruck, you are not walking away",
    "My cousin is a photographer in LA, California, and his justification for the truck was that it's the only car that can store his gear since car breakings became a common thing",
    "There's a reason cars stopped being made of stainless steel a long time ago. During a crash the force and energy will be transferred to the most fragile things first. When you have a rigid car, the thing that'll crumple first is the soft squishy human body. The actual cage of a car is usually steel so that you aren't squished to death, but that also means that T-bones are the most dangerous type of crashes because there's no crumpled zone to absorb the impact when you're hit.",
    "It's simply the most groundbreaking design ever. It's got 48 volts, it's stainless steel, and it's fast.",
    "You paid for aerocaps and didn't get them. Wow",
    "Did we just see how iconic the iPhone is?",
    "Just came to this comment section to ask: *No April 1st video?*",
    "I think it's ugly, but being ugly doesn't mean it can't be iconic. It's still something people haven't seen even with all the cars and supercars available today.",
    ".. the first seconds of the vid are proof that were living in zombie-nation .. and things are just starting .. welcome to hell :-D",
    "I don't think it will go the way of the PT cruiser, but more of the iconic VW Beetle bus. Tesla makes technology cars that push the envelope and continue to get better with",
    "Cybertruck will be iconic, but not everywhere. Those countries that will never see these on the road It will be iconic, for sure.",
    "It's strange not to acknowledge how many times Elon has been found to be lying in the past, and just posting his word as the truth",
    "When I first saw the back of the Cybertruck, I thought Pontiac Aztec. I've since grown to love it.",
    "This was so well made. I think Marques' love for Tesla shows off in all the review/overview videos made by him for their products.",
    "I've been driving my M3 around for three weeks now and can vouch that this video is 100% accurate on all counts.",
    "If Elon Musk shits into card boxes and puts a nice design on the boxes and has a huge press release praising how amazing, modern and futuristic those shitboxes are, it will sell millions.",
    "Comparing the cyber truck to the PT cruiser is offensive. The metal panels and all wheel steering are badass.",
    "The headlights get covered with snow because the front bumper creates a shelf for snow to sit on, and the rear camera gets covered in snow and road salt spray. It doesn't have a cleaning mechanism like the front camera, so in winter you'll have to drive with the tonneau cover down, which is just regular winter driving stuff.",
    "It's a truck designed to not be a truck. It's unsustainable and unsafe. The only interesting thing about it is the steering, but that also feels a bit sketchy.",
    "And that's why I subscribed mkbhd.",
    "You want a physical key to open the truck? I can't believe we are not already using the phone as key for all cars.",
    "I saw one the other day. I had mixed feeling about it. It looks cool but also looks like a fridge on wheels. ",
    "I saw you in Wayne the other day. Love the Cyber Truck.",
    "I think it will age more like a beetle. It's one of the most mast produced cars ever made over the longest time span of any production vehicle.",
    "It looks like it was imported from Mars, and has Martian aerodynamics. Despite whether we like it or not, it will affect the vehicles designed in the future.",
    "If the truck were to ever be submerged accidentally, how is someone to get out? The windows are nearly unbreakable, right? Is it still breakable with an escape tool?",
    "Only thru the intro, and I;m hooked",
    "It was a comment that struck me when I read it. Most of it is scary that what other cars company will see it. It is ugly, but hopefully other cars companies won't go that path as the truck we see now.",
    "I can sit through your videos even if they are an hour long. You know why, because you don't bullshit, you tell everything as it is",
    "I love the Cyber Truck, will love to have a glance at it in real life, but that's a long shot since I'm from a rural part of Africa. Some day, someday, someday.",
    "Marques sounds like a paid shill shilling so hard. It's Emperor's New Clothes.",
    "A biker's first reaction to this design and material choice is that if it touches you, the best case scenario is severe injury, but most likely fatal. I wouldn't be surprised if it got 0 stars on the NCAP pedestrian safety test.",
    "No, not already iconic. Its already ironic. ",
    "It's a symbol for wasteful, unsafe and ugly design,. Worst car of the century in many ways, just innately stupid.",
    "When the Cadillac Escalade was new, that gigantic ugly piece of car wasn't allowed. Some two years later it was permitted. So - modern cars are too big anyway.",
    "If the cyber truck is iconic, then so was the Pontiac Aztec. I haven't seen one in person yet, but I own a stainless steel fridge and know how hard it is to keep clean",
    "The most amazing vehicle ever built. Hands-down. Once again, Tesla is light years ahead of the rest of the world. Their innovation.",
    "watching your video is great. Only problem I have now is . I keep on sticking my tongue out compulsively",
    "25:37 hey dude you might want to change out this clip as its showing a womans chest through transparent clothes",
    "I wonder how Elon got the feedback about the gap and the number of trucks affected. It is impressive from the QA side and from his side that he actually gave a",
    "Why does this feel like your best mastered video? All over, the online and audio sound and look great. Did you go to a post house?",
    "It's like people decided to make the car big, and people will buy it because \"hey this car is big\" so the cycle repeats endlessly. Cars just look like you fused five different cars together.",
    "I see a back to the future reboot using this as the time machine.",
    "The last thing we need on the roads is more huge trucks. They make city streets unsafe, and they take up too much space. Can understand trucks being used for commercial purposes, but if you are using one as a daily driver, especially one that is not good for commercial use, you are a bit of a wanker.",
    "This car is a nightmare in every possible way - build quality, functionality, pedestrian safety, and overall value. This is going to age like milk - the truck, and this review.",
    "I wasn't ready for a Fast and Furious teaser without Dom.... ",
    "The minute I saw the gap, I knew it had to be the door latch and likely just loose bolts. I knew this because it happened with a pickup I owned 20 years ago.",
    "I wonder why a pedestrian who would be destroyed by a truck would be opposed to it, while a group of people in a vehicle would",
    "I don't get why people hate on it, I really dig the style. It looks like someone left a piece of paper in a wind tunnel and it formed the most aerodynamic shape. I want cars to be unique and absurd again.",
    "I will never buy it, but it is interesting to watch it. But wait. What's the difference between Fisker and Ocean? It doesn't work.",
    "Ahh yes, more Cybertruk click bait. Just what the doctor ordered.",
    "You won't be fine if you get hit as the car is too rigid to be actually safe in an accident. It also puts in more danger smaller vehicles, not to mention pedestrians or cyclists.",
    "Dude, I really get why you're the best at this. Fantastic presentation. ",
    "I feel like this will be an iconic vehicle for all the wrong reasons. Quality of fit in the first models, reliability of initial models, potential danger to other road users, and sycophantic behavior to hype this truck in a time when the owner is acting in such an unhinged way.",
    "The back is ugly AF, which is too bad because the front is cool looking. The more I look at it from the side, the more it looks like it's",
    "Rest assured it's going to maim a lot of people....",
    "Cool Video thanks. And cool german shirt :-). Greetings from Germany",
    "As always an incredibly great review, much better than the self-denying fanboys of haters did on many other channels",
    "Enjoyed this video way more than your first Cybertruck review!! Can't wait to get mine in 5 years!",
    "The Cybertruck is not 'iconic' and will never be. It's just a gimmick. People will no longer be talking about it or caring about",
    "My father's Ram 1500 had an issue where the steering column wasn't plugged in fully, and when it became unplugged, the whole truck shut down and he couldn't steer it. Both of us have dealt with \"heavy truck with no power steering\" and the steering didn't lock up, the steering wheel moved, but the wheels did not.",
    "I really didn't enjoy this review. It seemed indecisive. 16 min in, and it feels like you didn't want to make this video yourself.",
    "That transition into the Title card was EPIC!!!!!!!",
    "I was in college during this time, and 100% YES the PT Cruiser got all the attention on the road when they first came out. People would slow down on the freeway and take a photo if their phone had a camera at the time.",
    "A VW Beetle is iconic, and it's definitely not rare. Whether it remains iconic will mostly be about how it develops its reputation, and whether it will ever leave North America.",
    "I respect you hugely Marquess, but I don't enjoy watching Tesla videos not addressing the issues with Musk, his antics, and the many problems with Tesla",
    "I don't have words to describe how stupid and pointless I think this vehicle is. At best it gives me something to laugh at rich people for.",
    "If it is going to run into the same problems as the other Tesla cars has had with battery problems, finding charging stations in more than one town and being charged more money to charge it than buying gas, then what is the point of buying one?",
    "16:00 Non-americans don't undestand anything in this table. So yes, the Cybertruck is slow in km/h after a few meters.",
    "You will be fine. Typical American way of thinking. If you even consider not killing the neighbors daughter with your tank, you are considered a communist.",
    "I know this is about tech, but MKBHD's ability to ignore and overlook everything that Elon Musk is and who he is as a person is astonishing, really. You're not co-signing Elon's politics and views by buying a Tesla, but praising his products on a high traffic platform like this so much makes you wonder about their stance on many social issues today.",
    "6:39 \nIt's not bulletproof.\nIt's been demonstrated",
    "In the automotive sphere, classic cars, the Mustang, the F-150, the Wrangler were icons that embodied the American desire to Tinker. This Tinkering kept the American people free. Tesla has killed this, and other manufacturers are following. We are no longer free.",
    "If you are considering the cybertruck, please look at the rivian r1t. Its a great electric truck with just as many features",
    "As the saying goes - there is no such thing as bad publicity.",
    "I don't find the reverse camera display a problem. It's not new, the Toyota tundra has been doing it for a while, and I prefer the",
    "It's funny that you own a car that started out as weird and iconic, and then became mass produced. That's exactly the arc",
    "Youre the best bro. You do very insightful and detailed talk about the products.",
    "When you make bold or outlandish claims to sell a product, don't be surprised your customers will go full stupid-mode when they buy it.",
    "Wanna not overuse the phrase \"iconic\" bro , I hate it with passion. In fact I just vomited in my mouth by writing this bit .",
    "f",
    "@6:44 I thought bro was going pull out a 9mm from the trunk",
    "Where is the Xiaomi 14 ultra video daug? Come on!",
    "You and your team are so damn good at making these videos.",
    "I saw one for the first time last week at a Supercharger. It really does look like a movie prop and/or fake. Like, how can this be real? I think it looks pretty cool.",
    "This is easily one of the best and highest quality videos I have ever seen, seriously. The cinematic quality, the shots switching back and forth so seamlessly, the way Marques speaks; everything.",
    "It's dangerous, it's a stupid design, and it's heavy. It's as though Elon Musk became a truck. It is not sustainable and certainly not environmentally friendly.",
    "As always, insightful and entertaining review. Thanks Marques!",
    "I love the looks, eagerly waiting to launch in India. It's a combination of innovative tech and risk taking attitude that attracts me a lot.",
    "Portland, JAMAICA in the Building!!!  ",
    "The presenter is confusing the word iconic with notorious.\n\nThroughout the video he very effectively defines the vehicle as notorious.",
    "I was given the first of the new VW Beetles when I was in Los Angeles decades ago. It was a blast to drive as it got a lot of attention. A trip of 30 minutes would take double because of getting \"boxed in\" on the freeways by camera happy drivers",
    "stop sucking up to Elon for another interview - that is lame . Face it , Cyber-T is a lemon .",
    "Imagine a variable speed-based steering ratio that's purely mechanical (I imagine a simpler form of a CVT transmission on the steering column).",
    "I used to think that this thing looks stupid, but I recently saw one in person for the first time, and I have to admit",
    "The cyber truck is a snapshot of what is wrong with Murika these days, and the childish state of Musk's mind.",
    "I guess this is a consequence for owning such an unusual piece of automotive propulsion. It's like the time I dyed my hair orange for Halloween -- I got a lot of laughs at first, but after a day or two, the orange color did get a bit old.",
    "I know I am old and uncool, but are you actually posting it there? Are you showing it to your friends? are you ever going to go in and reminisce about that day you saw a bicycle? I know I'm being provocative in the way I ask, but I really want to understand!",
    "Just because a car was made in big numbers doesn't mean it's iconic or has a weird style or such. No one thinks about the PT cruiser except fans of the car, and no one except fans will know and care in a few years. When everyone knows what a cybertruck is, it will be iconic.",
    "He correctly points out the buggy Fisker software that people paid for, but forgets to mention the completely missing autopilot feature.",
    "Tesla's approach for the cybertruck is literally clout. They want so many people to just look at it that they don't have to make it good.",
    "The cross guard not doing his job and recording you is kind of insane lol",
    "Who thaught he was going to pull out an AR instead of a sledgehammer?",
    "Where's the Xiaomi Su7 review? Or you just want to promote Tesla",
    "For me, the cybetruck is a shiny trashcan\nIts shiny and gets your attention but thats it",
    "14:02 HELLL YESSSSSSSS",
    "Having the steering controlled by sensors means that if a sensor fails, you lose control. Mechanical parts can fail too, but electronic parts are more prone to failure long-term, and are more expensive to re-manufacture.",
    "I am astonished by how many quality issues and overhyped capabilities were ignored in this video.",
    "Really liked this video. I'd love to see more videos like this - opinions, unique observations, good presentation. Good job, MKBHD team.",
    "I don't believe this is independent journalism anymore. Fisker got killed for bugs in their car, and Tesla got away with releasing a car without FSD and the door falling off.",
    "Its fun to look back in design history and study things that where touted as being the future. None of those things aged well.",
    "Iconic?...more notorious...like a Pontiac Aztec. I've seen several in the wild now and they are ugly.",
    "The original VW Beetle and the Willy's Jeep had unique shapes that were distinctive and unique enough that the manufacturers kept the through line into future generations.",
    "The only reason it's even popular is the Tesla/Musk cult. Any other company making a car this stupid would get lambasted by the whole world.",
    "Fast and furious loves a 10-second quarter mile car; now I'm expecting a big truck in the next F&F, probably towing a space shuttle or cargo. Only problem they'd have would",
    "You can get it wrapped???",
    "I saw one the other day chilling in Woodstock, NY. The town is full of Subarus and Volvos, so to see this space machine in that context was so shocking. It was the first time a new car was able to catch my attention.",
    "It turns heads because of the novelty. A turd on wheels would have the exact same effect. I predict that in three years, every single owner will be ashamed",
    "I think it looks cool and futuristic!",
    "The truck may fail, but it will become a classic instantly regardless. It's going to be up there with the likes of the Lamborghini Countach, Ferrari F40, Nissan Skyline Coupe GTR, and Toyota Supra.",
    "The obsessive \"minimalism\" is my biggest pet peeve with Tesla. Rear visibility on the Cybertruck is so bad. It's safety/ergonomic negligence that they don't put a screen for the back up camera in the mirror.",
    "I feel like you skirted around the fact that this is a deathtrap for anyone outside the car. I see you trying subtle mentions, but who cares about fly by wire when it's hitting a cyclist with bulletproof steel?",
    "I finally saw one of these in real life, and I couldn't stop myself from laughing.",
    "This thing is uglier than established country music. The only reason I can find to buy one is to get a low Production number and keep the mileage low. Good examples will likely be worth a small fortune in",
    "For almost a year, it was exactly how you described. You couldn't go anywhere without someone lowering their windows to take photos, or running over to talk about it when you park. But now it has been two years and that's died down quite a bit.",
    "The front end lifts during acceleration or dives during braking; the vehicle is yawing when turning the front end left or right.",
    "A lot of people are going to be driving around a 3.5 ton metal brick. It's not going to look pretty.",
    "please give your editing team a raise! very talented !!",
    "Ugliest vehicle ever. Looks like a child's drawing. The interior is sparse and so badly designed. Just another rip-off.",
    "I doubt the Cybertruck has any true backup system if the steer-by-wire fails. All I see are electrical redundancies, no actual mechanical steering.",
    "The design and engineering of the cybertruck is iconic, but don't believe it is the first to come up with steer by wire system in a production car. Steering by wire has been an option in Nissan infinity models since 2013.",
    "Those are not the same tires you can buy with the same name or that come on the trucks you mentioned. These are a special Cybertruck-specific Goodyear tire that has the tread shaved down.",
    "I remember the first time I saw a Model 3 in Seattle, it felt iconic then. After years of mass production, it's no more special seeing",
    "The last few minutes of this video are very interesting. The PT Cruiser by Chrysler versus the Cyber Truck by Tesla is the difference. The expectations from consumers going forward will be that Tesla is associated with a brand that is going to send humans to Mars.",
    "Uttered Countach and Veyron in the same sentence as this monstrosity love you Marques but stick to smartphones lmao",
    "Let's say I buy an EV right now. What does that change? I am still going to produce CO2 with fast fashion, eating meat, and etc. Car production is a ton of CO2.",
    "I would never buy a car where the steering wheel is disconnected from the wheels. As an amateur radio, I know that zero electronics are RFI (radio frequency interference) proof.",
    "The performance section, all I wanted was for you guys to do a single corner. Any corner. That would have been funny.",
    "Steer by wire in concept doesn't scare me, but the fact that it's Tesla that implemented it scares the hell out of me. I don't trust them at all to have made it as reliable as it",
    "Good EVs with good performance can be quick, but not fast. A Chevy EV, for example, is not quick; a Mercedes is not",
    "There's a 0% chance Elon was lying when he said that only around 15 cars had that issue. Seems like an oddly specific, oddly low number for a mass produced car from a company known for",
    "Memecar",
    "Car Life Scouring Multi Purpose cleaner is probably the best cleaner for these Cybertruck. I saw someone demoing it at a car show and it's pretty impressive.",
    "If 30% - 40% of those reservations become actual sales, Cybertruck deserves to be in the same league.",
    "I feel that the Cybertruck is only about the design. Steer-by-wire, 800V architecture or clever air suspension are not the cars selling point. The design, on the other hand, is.",
    "Seeing Marques make excuses for the Cybertruck and ignore all the other issues and complaints that have been coming up is just sad. Basically just a hype man for Elon at this point",
    "They pose a significant threat to basically any other car on the road because of the steel frame and mass. It'll go right through a ford explorer.",
    "As iconic as the VW Beetle. The first one. The one designed in 1939.",
    "I'm gonna disagree that being iconic means rare; just look at any books of \"the most iconic products\" and you see mass-produced products.",
    "How can you list so many flaws and knowingly miss so many more flaws and still say it is a good car?",
    "This was such a lovely video and review. The hard work you put into it shows",
    "its not iconic, the Delorien is iconic",
    "They should've released a much more conventional truck and gotten it out 2-3 years ago, but on some level it's just a marketing stunt and in that respect, I guess it worked.",
    "Just because the car is intact doesn't mean you will be fine. If the car transfers energy from the crash to the squishy marshmallow behind the wheel instead of dampening it with crumple zones",
    "I don't care if people drive interesting and weird cars, but putting other people at risk sucks. Getting a thumbs down from the cyclist is because that person doesn't feel safe around that vehicle, and for good reason.",
    "I think getting a thumbs up (or thumbs down) in real life is underrated.",
    "The cyber is one of the most interesting cars I've seen. It looks horrible on pictures, but it's beautiful in person.",
    "I am getting rust vibes, I don't know why...",
    "It doesn't have to be rare to become an iconic design in a good way. I personally find the Cybertruck ugly, but it is undeniably iconic.",
    "Yeah, I laughed the first time I saw one. The second time some wrapped one, it was still ugly but looked better. Lmao",
    "In Dutch and German, the word for clever developed along two lines. In one language it still means clever, but in the other it means you were bad. Marques using the word clever in a similar negative way shows exactly how the meaning of a word can change.",
    "kuradi Werbung",
    "I remember seeing a PT Cruiser and thinking how cool and unique it was. Now I see it and just wondering what was I on?",
    "Wow what a production, felt like a cybertruck movie, visual effects sound effects this is god level production",
    "Did you said he is your child? Aren't you in your mid 30s? This young man looked like a adult?",
    "Hmm looks like Elon took some styling cues from Lamborghini when I look at it from certain angles.",
    "Cybertruck is for the nerd gamers from moms basement like Marques here, who won't actually do any blue collar work because then he'd find out that it actually sucks as a truck, and is beaten by even a barebones F-150.",
    "What's the ct1 that showed for 1sec and you tried to hide it",
    "I do not like any electric vehicle. If it isn't broke, don't fix it. If I am going to get a truck, it's a Tundra or",
    "We need to stop building cars that are too big. This is a middle finger to the earth. That it is electric does not make it any better",
    "This is the most expensive disaster of a vehicle I've ever seen in my life. It is glorious to see people waste life savings and go into debt for it",
    "I think Marques is the best storyteller YouTuber. Hot take?",
    "People always put their negative comments forward if they don't have anything nice to say or if they're jealous.",
    "It's a vehicle for the most devout cult members.",
    "\"Minimalist\" means boring. Unless you get it wrapped, the rusty patina is going to look ugly in no time.",
    "The way you said that line with the hand motion and the slight smile had me cracking up.",
    "This is the awesomest title intro I have seen on any video till now. Great job guys!",
    "5 drops of LSD and your brain will finish the rendering. Trust me I am a smackhead",
    "11:28 nobodys buying an f-150/silverado 1500/ram 1500 if theyre towing on a regular basis. that survey is a bad representation of the towing market.",
    "What I hate most about teslas are not the cars, it's the drivers and how cocky and dangerous they are on highways. I've seen one or two cars in my small hometown, and from what I could tell they were just driving normally.",
    "you're a great reviewer and calming not hyper with loud background music or sarcastic stuff - appreciate that",
    "How is it with the battery? How much do you use per run? How long do you have to wait before the next one to prevent overheating? Do you notice that the battery goes down much faster or not?",
    "In my eyes the attraction of road users isn't it's most dangerous part. The designers put totally random American stereotypes on the table and said 'let's do it all in one car' The failure of marketing it in any factual or practical way hits the final nail in the coffin. I haven't seen a Tesla with soul or character. It's all hightech and standing out. That is in no way at all what makes a Ferrari or a McLaren the beauties they are. It is hype. Nothing more. In 30 years we will look back at it and maybe see why it was modest, but nobody will ever understand why it had to be made in the first place.",
    "People often complain about no knobs and switches on Teslas. Teslas handle all kinds of verbal commands to do things buttons and switches would, like turning on the wipers or making the AC/heater less cold/warm. Also has scroll wheels on the steering wheel to change audio volume or change fan speed.",
    "A physical button is better until you don't need it or need an extra one. You can't constantly update physical buttons or make them better, that's why they're worse. Do you think phones should go back to keypads",
    "It's just cool.\nWe need more cool stuff in the world.",
    "The only modern looking and innovatively designed car for 70 years.\nZero to One.\nAll other cars are just boring legacy auto.",
    "The Porsche comparison is so tiring. The towing test was done against a BASE NON TURBO. Why is that so hard to understand?",
    "A truck will kill people as more of them hit the roads. The driver will always be safe mostly, but imagine a bike or two wheeler colliding with the Razorblade of a \"truck\".",
    "I see where you are trying to go, but it's hard to compare the Cybertruck to the PT Cruiser. The PT Cruiser wasn't an innovative vehicle; it just had a unique look at the time. So",
    "Excellent video. Great production skill. Great informational review, and all around professional.",
    "Just watched on of your first videos and then watched this one. Its insane how far youve come when it comes to quality.",
    "We will learn more when Munro analyses the 48V architecture. Other tear downs are already happening and it appears some accessories are 12V in the Cybertruck.",
    "Dude this is the best review ever in the history of mankind I  you @mkbhd.",
    "It will go down in history as a testament that people will buy anything for the sake of being 'different', 'quirky', or 'disruptive', even if the product looks like it escaped from the factory mid-production.",
    "The blue hoodie is so clean. anyone got an ID?",
    "This culture of cars is damaging our environment. What we should do is move away from using massive cars to move one person and instead have more public transport alternatives around the world.",
    "Everybody thinks it's ugly as hell, but I've been staring at it for years and I can't tell anymore. That's a good thing, right?\"",
    "I'd say also mass produced products can be iconic. A VW Beetle is iconic, many Apple products could be considered iconic.",
    "However great it is, it wont be sold outside of the USA.",
    "The truck has a monobrow that doesn't even extend, leaving the passenger with a half cleaned windshield.",
    "A lot of car guys don't like electric cars, especially those coming from the JDM and/or drifting community.",
    "who tf is saying that it doesn't look nice?",
    "It's easy to criticise new concepts, but what annoys me is the many people who will buy it and never use it as a truck.",
    "Marquis, could you talk a bit about battery degradation with those vehicles that constantly use Superchargers? You've got a model S for quite some time, must know a",
    "This video was very well scripted. Thank you and the team for making so great content.",
    "Some people get distracted by the bulletproof part. It's just a way to highlight that the truck has a rugged exterior, which is one of the two key selling points of pickups. It wasn't designed to be bullet proof.",
    "I've been selected to pick up my reservation, but I don't want it anymore. I would have liked to just sell it, but that seems to be a big nono.",
    "What aspect ratio are you using for the video? Because with my phone it fit perfectly. It's not too small and it's not taking all the screen... It's just right!",
    "The most dangerous thing about the Cybertruck is that it will cut off your finger, or your child's fingers, if the door shuts on them. Everything will stain the \"Stainless\" steel. Lots of soaps and chemicals, bird poop, and on and on.",
    "None of the footage made on the road seems real; the car looks so different that I can't wrap my mind around the fact",
    "People are so predictable when it comes to new things. C12 looks like the Dominator from storm chasers.",
    "If you talk to a stranger who describes your vehicle looking 'crazy, like a movie prop, alien, I'm not sure you can count those as positive remarks. It's just a polite way of not calling your purchase ugly.",
    "Bro, is it possible see an MKBHD PLAUD Note review?",
    "I would love to see a video on your production process again. From backstage looks to you on camera.",
    "yeah i think most people would have the same reaction if they saw a koenigsegg or a pagani where most 0people dive a scaped altima",
    "The thumb showing Marques in the blindspot of a hulking steel knife on wheels is NOT iconic.",
    "I just know they loved that B roll of the cybertruck between two semis",
    "This thing has that predator vibe... Lions still have that revere even in their nimbers",
    "I love and hate listening to someone brag about how capable their 4x4 is. The less they know about off-roading, the more capable they think their vehicle is. An expert will never brag they're capable of more than they can do.",
    "It's iconic to me too, but even without the rare factor :) Awesome video & Thanks :)",
    "I thought it was funny when I watched your last video. My door won't shut all the way.",
    "A very good review. Thank you, Marques",
    "If the truck won't turn on, your only option is to tow it with a tow rope, how do you steer it?",
    "I have a motorcycle that is called the Beast, the super Duke 1290. It has its detractors because of the futuristic sharp angle looks it has, but the amount of people that want me to rev the throttle on it says that people love the looks. I use my grand Cherokee for hauling my tools around.",
    "I don't really care about the cybertruck; it's not going to be a vehicle I'll ever see in my country. Nobody here uses a pickup truck, except landscaping companies. I don't like Elon Musk; he's a moronic person; no one should support him with",
    "A mixture of hydrogen peroxide with a small amount of vinegar and salt will speed up the rusting process.",
    "Bicyclist, a member of one of the most obnoxious groups of people in the world, would openly express their dislike of this vehicle, while a group of normal people in a car loved it. Both could've rode right by without externalising their opinion of it, but one chose to express positivity and the other negativity.",
    "I would sincerely be delighted if Tesla made an aluminum version with softer edges and available with the standard colors of their other vehicles. I would hope that a material change would also lower the cost of production tooling and provide a cost savings for those looking for an alternative EV truck.",
    "I hate the way the cybertruck looks, and I don't particularly like tesla, but I'd say it's pretty iconic.",
    "If you're 6'2, you have to contort to get in the front, and you can't sit in the back. Massive pillars impede visibility, and terrible viz out the rear.",
    "I find it fascinating how electric cars are making manufacturers to think outside of the box. But here we are, why make a car with a classic form dictated, more or less, to buy engine under the hood?",
    "I bought a 2010 Kia Soul in May of 2009 and it must have been one of the first in the Seattle area. For a good year and a half it was fun watching people do a double take while driving down the street.",
    "I'm trying to understand whether I like the truck or not. Not sure that word like qualifies, but more would go for it, just for fun.",
    "Your YouTube is destroy American EV industry. China's EV industry are selling all over the world. One of Chinese EV company sold 120,000 in a day.",
    "Will you ever speak to the fact that Tesla is dropping the ball and the car is unreliable as hell? Or will you just ignore this",
    "I don't know if you were racing each other or just the clock, but the but truck got a much better launch.",
    "At first they were unique, but now no-one cares if they see one on the road. The only thing about regular teslas is to conclude if the owner is a smug douche or not",
    "At first, people didn't know if they should love it or hate it, but then it became everyone's go-to and every company did the same thing. At first it looked foreign and unique, now it is iconic and something everyone has.",
    "Yesterday I saw one in my town and it was the most ugly vehicle I have seen in my 58 years. It looked much worse in person. I'm not saying it is a bad vehicle, but I wouldn't be seen in one.",
    "You have a very strange definition of iconic. Three iPod with a click wheel is not iconic. It certainly was not rare.",
    "I'm not sure who you are talking to, but it is the ugliest thing on the road. It's not iconic.",
    "\"You're now 100k in debt for a meme, and you feel nothing.\"",
    "It attracts attention like a car wreck. It's unusual not well designed. Excellent video as always.",
    "This was such a killer video. The drag race break down was wild!",
    "Such a great video man, such a wholesome video. I was thinking if there are millions of videos on this and I have watched every single one of them, what different is this video going to do? But yet again marques pulls up something interesting that you eagerly feel like watching.",
    "The truck looks cool but it doesnt at the same time. Idk, I would get one if I could though. Its like that weird cool",
    "Any other company providing something in such a state would get ridiculed. The panel gaps, trunks that can cut your fingers off, most stain-able car in existence, steering wheel that falls apart after two months.",
    "Only thing I hate about CT is that it's a truck. The design language, the tech, it's all awesome, but they had to make yet another chubby",
    "The Auto Focus license plate, the space this is filmed, the graphicsman this video is sickand Im only at 2:53",
    "Man this video was so fun, you did well team",
    "24:17 no way the ratio of joy to disgust is 80/20. Every person I talk to hates it",
    "Xiaomi SU7 review next????",
    "Kinda laughing that this one isn't on Autofocus. Marques saves the smaller channel for Fisker. Don't waste those Tesla views!",
    "Jesus dude, it was not a panel gap.  You really are not paying attention.",
    "It's still a fact that cars are only used 6% of their total life. The average American drives 30 miles per day only.",
    "Marquis talking about comparison with the 911, then casually walking towards it and comparing the vehicles himself.",
    "'Yaw' is pivoting left and right, not up and down. 'Pitch' is the nose moving up or down; 'Roll' is nose tilting or banking left or right; and 'yaw' are the nose pivoting or swiveling left andright.",
    "Loved watching this video. It felt very high-quality change from seen to seen",
    "The cringiest word from the last Avatar movie is unobtainium. The name itself is just as cringy as unobtain",
    "30 minutes and no mention to the rusting materials. Thats iconic"
]